[
  {
    "title": "BFT: The Most Secure Proof-of-Stake",
    "slug": "bft-the-most-secure-proof-of-stake",
    "author": "Jae Kwon",
    "date": 1479168000000,
    "body": "<p>Bitcoin brought the world’s attention to the blockchain. But alas, the Bitcoin\nversion of blockchain isn’t sufficient for the world’s blockchain needs. That\nis because Bitcoin’s proof of work (PoW) consensus <a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">requires an enormous amounts\nof energy</a>. In addition, transactions are painstakingly slow, taking an hour or\nlonger to commit. And because PoW miners have little incentive to be loyal to\none chain or other, upgrades are difficult to coordinate.</p>\n<p>We need an approach to manage blockchains securely that does not impose a huge\nenergy cost on our planet. That approach is Byzantine fault-tolerance\n(BFT)-based <a href=\"https://bitcointalk.org/index.php?topic=27787.0\">proof-of-stake</a> (PoS).  We call it BFT-PoS.</p>\n<p>Before I delve into the merits of BFT-PoS, let me first address the concept of\nByzantine faults without going into confusing detail about <a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport’s General\nand his armies</a>.</p>\n<p>In a distributed system, where data is replicated across hundreds or thousands\nof nodes, there needs to be some type of fault-tolerance or consensus\nalgorithm, for the simple fact that computers break down or go offline from\ntime to time. So if a portion of those nodes fail, the system as a whole still\nneeds to reach a consensus.</p>\n<p>Standard fault-tolerant consensus algorithms like\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a> and\n<a href=\"https://en.wikipedia.org/wiki/Paxos_(computer_science)\">Paxos</a> assume that\nwhen a node fails, it simply stops working and doesn’t send back a reply.\nGoogle, Facebook, and some existing database products already use this family\nof consensus algorithms within their firewalls to ensure that services remain\navailable despite faulty computers.</p>\n<p>But these algorithms aren’t suitable for public blockchains, because there is\nno firewall in a public blockchain.  Anyone with mining power (in PoW) or\nstaking tokens (in PoS) can participate, or even try to sabotage the network.\nTo reach consensus on a public blockchain, we need Byzantine fault-tolerance.\nIn a Byzantine fault, the faulty node can behave in a completely arbitrary\nmanner. Nodes can even collude to try and maximize the damage they cause.</p>\n<p>So essentially, the purpose of a BFT consensus algorithm is to establish trust\nbetween otherwise unrelated parties over an untrusted network like the\nInternet.</p>\n<p>BFT is nothing new. The concept was first introduced in an academic paper by\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport, Shostak, and Pease in\n1982</a>. But\nLamport et al only demonstrated the theoretical feasibility of the algorithm in\na synchronous environment, where all the messages always arrive on time.</p>\n<p>But in the real world, you can’t really trust the Internet to deliver anything\non time. So in 1988, <a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork, Lynch, and Stockmeyer</a> (DLS) proposed an algorithm\nthat works in mostly asynchronous environments.  Later in 1999, <a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\nand Barbara Liskov</a> proposed a practical solution for continuous BFT consensus\nthat was, and still is today, the state-of-the-art in BFT algorithms.</p>\n<p>But for a long time, the mainstream press ignored these seminal works. Nobody\nunderstood the importance of BFT outside academia and major institutions like\nIBM and DARPA, until 2009 when Bitcoin came along. Bitcoin was the first open\ndecentralized application to provide BFT consensus on a global currency ledger,\nbut using a completely novel solution to the Byzantine general’s problem: PoW.</p>\n<p>In PoW, miners compete, based on who has the most processing power, to validate\ntransactions. And for their efforts they are rewarded with transaction fees and\nnewly minted bitcoins. This is how Bitcoin creates new currency.  Bitcoin\nminers around the globe compete in a lottery-like system for these newly issued\nbitcoins, and the efficient market makes it so that the cost of the energy used\nby the global mining network is on the order of the block reward (plus\ntransaction fees).  Today, that turns out to be around $1M worth of electricity\nper day.  In addition, Bitcoin mining is being commoditized by <a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">large data\ncenters in places of the world where electricity is more\naffordable</a>, making it\ndifficult for laymen to participate.</p>\n<p>PoS, on the other hand, does away with the energy dependence of PoW entirely.\nIn PoS, miners are replaced with “validators” who have a stake in the system.\nValidators don’t have to invest in expensive processing systems but they do\nhave to purchase “staking tokens.” Any normal laptop will suffice to solve the\nalgorithm.</p>\n<p>Peercoin, <a href=\"https://bitshares.org/\">BitShares</a>,\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a>, and others already use some form of\nPoS, and Ethereum is planning a move to PoS in the near future. Yet, while PoS\nmakes practical sense, many people have <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">rallied against the use of\nPoS</a>, claiming it is\nimpossible to secure. But that is simply not true. Using BFT, you absolutely\ncan secure PoS.  It’s just that we haven’t seen any BFT-PoS public blockchains\nyet.</p>\n<p>While the theory may be difficult to explain or understand, the ultimate\nresults provided by proper BFT algorithms are simple to grasp.  Unlike PoW\nblockchains, BFT-PoS blockchains do not fork (i.e. get double-spend attacked)\nat all unless ⅓ or more validators coordinate such an attack.  And, when 1/3 or\nmore validators do cause a double-spend attack, we can computationally\ndetermine which validators were responsible for the attack, destroy their\nstaking tokens and eject them from the network.  It’s as if the staking tokens\nare virtualized PoW miners that blow up when used to attack the system.  No\nother blockchain consensus algorithm, including PoW, can provide the level of\ncollateralization that is possible with BFT-PoS.</p>\n<p>BFT-PoS performs extremely well. Today, in global public blockchain with a few\nhundred validators, you can get transaction finality on the  order of 3\nseconds, easily – no need to wait for additional block confirmations! The\ntheory has proven to us that these are optimal fault-tolerance thresholds for\n“instant-finality” blockchains.  While more validators does slow down\nconsensus, if <a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">Nielsen’s\nlaw</a> continues to hold,\nwe’ll even be able to support an exponentially increasing number of validators\nevery year with the same performance.</p>\n<p>In addition, BFT-PoS will also increase the security of mobile wallets. Few of\nthe mobile wallets in existence today take full advantage of the security\noffered by Bitcoin, for the simple fact that nobody is willing to wait an hour\nfor a transaction to clear. Instead, most wallets just assume that <a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">the person\nsending the money isn’t trying to double spend\nit</a>.\nAnd, though we don’t have time to dive into it here, efficient mobile wallet\nprotocols, or “light client SPV” protocols are the key to future blockchain\ninteroperability.</p>\n<p>While PoW worked well for Bitcoin, it’s costly, slow, and environmentally\nunfriendly. The best alternative out there right now is BFT-PoS. It’s an\nenduring, energy efficient solution that works well in asynchronous\nenvironments. And best of all, because BFT was developed by the best and the\nbrightest in the computer science industry, it’s provably secure. You can’t do\nany better than that.</p>\n",
    "dateFriendly": "November 15, 2016"
  },
  {
    "title": "Purpose of Cosmos",
    "slug": "purpose-of-cosmos",
    "author": "Jae Kwon",
    "date": 1472601600000,
    "body": "<p>We believe in the power of public blockchains to provide a public good,\npowered by a collection of self-motivated actors governed by the rules of a\nshared consensus ledger, in an environment of competition and freedom of choice.\nWe have learned important lessons from the successes and failures of prior\ncryptocurrencies,  and have been creating innovations of our own that will\nunleash a new era of speed, security, scalability, and usability.</p>\n<p>Cosmos is a culmination of these lessons and innovations, designed to be\nextended to incorporate even future innovations, to create a distributed ledger\nplatform suitable for generations to come.</p>\n<p>One of the great tragedies of cryptocurrencies has been their failure to\ninteroperate with existing systems, and even with each other.  It is as if each\nvirtual currency, on its own blockchain and with its own community, were too\nsovereign for its own good.  This is made most apparent when you attempt to buy\nyour first Bitcoin: you discover that it is remarkably difficult to buy the new\ninternet money over the internet, at least without divulging considerable\namounts of personal information and allowing weeks for it to be verified by\nthird parties (exchanges) you hardly know and have been warned not to trust with\ntoo much of your money.</p>\n<p>While mechanisms like <a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">atomic\nswaps</a> between chains can\nhelp link communities, they suffer from a need for mature liquidity markets and\nactive participants on each side (or suffer long timeouts).  The <a href=\"https://coinmarketcap.com/\">alt-coin\necosystem</a> is an alchemical soup of enthusiasts\nexperimenting in various ways in new cryptocurrency design, but each alt-coin\nstands alone, siloed by the lack of a general inter-blockchain communication\nsystem, many needlessly wasting electricty through convoluted Proof-of-Work\n(PoW) designs.</p>\n<p><a href=\"https://ethereum.org/\">Ethereum</a> sought to address the problem, somewhat\nindirectly, by inventing a new platform for computation, allowing arbitrary\nfinancial systems to be written against a common virtual machine using a common\ndevelopment environment.  Presuming all new cryptocurrencies launch on Ethereum,\nthey will all have some capacity for interoperability.  Ethereum is a wonderful\nidea, but the design decisions, while motivated by important considerations\n(like the need for a simple specification and guaranteed determinism), neglect a\ngreat many more (like the difficulty of designing a secure general purpose\nprogramming environment), and lends Ethereum it’s own sovereignty problem, which\nis that it excludes users who want access to the platform but want alternatives\nto the current state transition machine.</p>\n<p>Of course, Ethereum doesn’t address the problem of turning fiat currency into\nether, either, short of having banks and major government bodies issue their\ncurrency on Ethereum.  And while\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">many</a>\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">such</a>\n<a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">institutions</a> are\ninvestigating the Ethereum blockchain, there are both scalability and governance\nconcerns that will restrict its full scale adoption, and hence impede\nintegration with existing systems and currencies.</p>\n<p>Each existing cryptocurrency supports some cultural ideal.  Bitcoin is decidedly\nlibertarian, with a slight anarchist leaning which is ultimately betrayed by the\neconomics of Proof-of-Work.  Ethereum is less a political statement and more an\navant garde academic excercise in distributed systems, computer science, and\ncontract theory.  Dogecoin is a testament to the capacity for Humans to bond\nover the absurd, a phenomenon more commonly known as “being social”.  Steem\noffers a more structured version of being social, with a basis in content\nproduction and curation.  And so on. But there are many more idealogical\ncurrencies to create, many more virtual machine designs to try, each affording a\nunique experiment in the intersection between governance, culture, and\neconomics.  Would it not be a tragedy for all these experiments to be so rigidly\nsiloed from one another by great chasms of incompatibility?</p>\n<p>Clearly, what we need is something more general than Ethereum - a sort of meta-Ethereum;\nsomething that can integrate existing codebases and the states of existing blockchains;\nsomething that can interface in a sane manner with the currencies issued by nation states;\nsomething that formalizes the relationship between cryptocurrencies and connects them without compromising their independence;\nsomething with extreme flexibility that does not compromise security.</p>\n<p>Enter Cosmos. Cosmos is a network and a framework for interoperability between\nblockchains.  It consists of a web of “hubs” and “zones”, where each “zone” is\neffectively an independent blockchain with an arbitrary cryptocurrency design\n(be it like Bitcoin, Ethereum, ZeroCash, CryptoNote, your local banking\ninstitution, etc.), and each “hub” is a multi-asset cryptocurrency that\nfacilitates interoperability between some set of zones.</p>\n<p>Hubs and zones are powered by the <a href=\"http://tendermint.com/\">Tendermint</a>\n<a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">Proof-of-Stake (PoS) consensus\nalgorithm</a>,\nusing the <a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP\ninterface</a> to host\napplications written in any programming language.  TMSP permits enormous\nflexibility in application design, and enables the application to inherit the\nsecurity features of a Tendermint-powered blockchain.</p>\n<p>Zones communicate with one another through a hub, primarily in the form of\nassymetric transfer of some set of tokens from one zone to another.\nEffectively, a hub is a blockchain with many\n<a href=\"https://blockstream.com/sidechains.pdf\">sidechains</a>, but using PoS instead of\nPoW leads to a dramatic reduction in overhead without sacrificing security.  The\ntrick is that each zone acts as a light client for the hub, and the hub acts as\na light client for all its zones.  <a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">Tendermint makes this\nefficient</a>\nwith compact light client proofs that are secure so long as the validator set is\nknown, which can be achieved by ensuring the light client <a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">synchronizes with\nvalidator set changes at least as often as they are permitted to\noccur</a>.</p>\n<p>Many people have <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">rallied against the use of\nProof-of-Stake</a>, claiming it is\nimpossible to secure.  Simultaneously, they acknowledge that it is nearly\ntrivial to secure many PoS chains using a single, secure PoW chain.  It is <a href=\"https://twitter.com/buchmanster/status/738550345597648896\">my\nown position</a> that\nthe correct number of PoW chains is one, and the correct number of PoS chains is\nin the thousands or millions, on par with the number of currencies, rewards\nsystems, and various other token-based systems in the world.</p>\n<p>Cosmos reflects this position in that it makes no distinction between hubs - there\nis no “top” hub, and the most popular or successful hub is a matter of adoption\nby zones.  Furthermore, there is no fundamental distinction between zones and\nhubs, such that any zone with sufficient functionality can become a hub.  While\nwe will release one particular hub in order to get things started (the aptly\nnamed Adam hub), there is nothing stopping this hub from becoming obsolete as\nother hubs, even the likes of Bitcoin or Ethereum themselves, come to compete\nwith it, and potentially replace it.</p>\n<p>Cosmos thus introduces a new kind of market dynamic that formalizes the power\nstruggle between the various cryptocurrency offerings, demolishing the barriers\nto interoperability and enabling competition between hubs to contribute to the\neconomic security of each hub itself - validators who misbehave will be\nabandoned for better behaving ones.  The result is a heterogeneous network,\nadapting for each community and each locale according to its needs, and yet\nretaining a backbone of interoperability that keeps barriers to entry low while\nholding stewards of the system accountable and quality of service high.</p>\n<p>Whether as testing grounds for new cryptocurrency designs, or an upgrade to\nexisting ones, as a means for decentralized exchange, or a platform for scalable\nsmart contracts, Cosmos’s potential is that of every existing cryptocurrency and\nmore in synergy.  The only question is, what will you build on Cosmos?</p>\n",
    "dateFriendly": "August 31, 2016"
  }
]