{
  "en": [
    {
      "title": "Fundraiser Was a Resounding Success",
      "slug": "fundraiser-was-a-resounding-success",
      "author": "The Cosmonauts",
      "date": 1491436800000,
      "body": "<p>Wow. That was remarkable. Within seconds of opening <a href=\"https://fundraiser.cosmos.network\">the fundraiser</a> at 6am PDT this morning,\nwell over a million dollars worth of BTC and ETH poured in. Obviously, many of you were very\nwell prepared. Over the following roughly 30 minutes, we raised over 16M USD worth of BTC and ETH,\nsmashing through our hidden cap of 17M.</p>\n<p>Thank you everyone for your amazing support!</p>\n<p><a href=\"https://fundraiser.cosmos.network\">The fundraiser is now closed.</a> It’s time for us to get back to work on building out the Internet of Blockchains!</p>\n<h3 id=\"proof-of-the-hidden-cap\">Proof of the Hidden Cap</h3>\n<p>Our goal for this fundraiser was to raise 10M USD. However, seeing as how quickly\ncertain other fundraisers have hit their cap, we decided to allow more than 10M to be\nraised within the first 6 hours. That said, we did not want to be in a position where we\nraised too much money, so we set an additional hard-cap, such that if we hit that, we would halt\nthe fundraiser.</p>\n<p>We decided to keep this hard cap hidden, because we felt doing so would discourage whales\nfrom buying too much. Indeed, we got a lot of feed back on slack that many people were discouraged\nfrom donating too much because of this hidden cap - exactly the effect we hoped for!</p>\n<p>On March 26, 2017, Jae published a commit to the hidden cap on twitter: <a href=\"https://twitter.com/jaekwon/status/846055257675218944\">https://twitter.com/jaekwon/status/846055257675218944</a>.\nThe commitment is <code>5faa9a8d3faa019b836f63779c454aa2cefa310ba1e04b251dcbfcd3db5471ec</code>.\nThe pre-image for this is the following text:</p>\n<pre><code>SALT: 26ed7ab241901f7e0a7d\nMSG: The cap for the first 6 hours is $17M USD\n</code></pre>\n<p>If you save that text in a file, say <code>cap.txt</code>, and run <code>shasum -a 256 cap.txt</code>, you can confirm the commitment.</p>\n<h3 id=\"suggested-atom-allocations\">Suggested Atom Allocations</h3>\n<p>For each donation, the Interchain Foundation suggests a certain number of Atoms be allocated\nto the relevant Cosmos address in the genesis block of the Cosmos Network.\nThe Cosmos Network is expected to launch in Q4 2017, and Atoms will not be accessible until then.\nThat said, the suggested Atom allocations for a given donation can be easily computed.</p>\n<p>First, you need your Cosmos address. If you did not write it down during the fundraiser, no worries.\nYou can use the <code>cosmos-fundraiser</code> tool to figure it out, so long as you wrote down your 12-words.\nIf you lost the 12-words, your Atoms are gone forever.</p>\n<p>To install the tool, you must have <code>node.js</code> installed. Then simply run:</p>\n<pre><code>npm install -g cosmos-fundraiser-cli@2.11.0\n</code></pre>\n<p>Now you can check your Cosmos address by running:</p>\n<pre><code>cosmos-fundraiser cosmosaddress\n</code></pre>\n<p>It will prompt you for your twelve words, and will spit out your address.\nPlease make sure you enter the words correctly.</p>\n<p>If you donated in ETH, your suggested Atom balance is stored directly in the smart contract.\nTo query it, enter your Cosmos address in the <code>record</code> field here: <a href=\"https://etherscan.io/address/0xcf965cfe7c30323e9c9e41d4e398e2167506f764#readContract\">https://etherscan.io/address/0xcf965cfe7c30323e9c9e41d4e398e2167506f764#readContract</a></p>\n<p>If you donated in BTC, your Cosmos address was recorded in an OP_RETURN output.\nThere is no easy way to query for your suggested Atom balance yet, but if you lookup\nyour transaction on <a href=\"http://blockchain.info\">blockchain.info</a>, you should see your Cosmos address recorded in the second output,\nnext to OP_RETURN. Note that <a href=\"http://blockchain.info\">blockchain.info</a> doesn’t handle OP_RETURN, so it will say “Unable to decode output address” -\nthat is fine and totally expected. To get your suggested Atom balance, just multiply the amount of BTC in the first output\nby 11635. Also note, your transaction MUST be included between block 460654 and 460661, inclusive.\nIf your transaction is included in a block outside this range, your suggested Atom balance is 0.</p>\n<p>We will put up a service in the next couple days to make it super easy to query for your suggested Atom balance directly,\nwhether you donated in BTC or ETH.</p>\n<p><strong>Update:</strong> The Atom balance viewer is now available on <a href=\"https://fundraiser.cosmos.network\">the fundraiser page</a>.</p>\n<h3 id=\"issues\">Issues</h3>\n<p>If you had any issues with the fundraiser, please contact us at fundraiser@cosmos.network.</p>\n<h3 id=\"conclusion\">Conclusion</h3>\n<p>Thanks again for making <a href=\"https://fundraiser.cosmos.network\">this fundraiser</a> an epic success! We look forward to building the Internet of Blockchains with you.</p>\n",
      "excerpt": "What a fantasitc fundraiser! Thanks to everyone!",
      "redirect": "https://blog.cosmos.network/fundraiser-was-a-resounding-success-bf378b96fe00",
      "dateFriendly": "2017-04-06"
    },
    {
      "title": "Understanding Inflation in Cosmos",
      "slug": "understanding-inflation-in-cosmos",
      "author": "The Cosmonauts",
      "date": 1491264000000,
      "body": "<p>Many people have asked us how the Cosmos inflation rate works. Inflation is a\nloaded term. It evokes a process outside our control. Something that devalues\nwhat we own. That threatens us. Fortunately, inflation in Cosmos is a much more\nfriendly force.</p>\n<p>Let’s look at a comparison to Bitcoin first. Bitcoin has often been promoted\nas a hedge against inflation. The monetary supply of fiat currencies is\nexploding. For one measure, M3, the USD monetary supply grew by <a href=\"https://data.oecd.org/money/broad-money-m3.htm\">55% since\n2010</a>. Bitcoin still has\ninflation, currently at almost 4%, but that is going to zero and is\npredictable.</p>\n<p>Like in Bitcoin, in Cosmos the inflation rate plays an important role in\nsecuring the network. In Bitcoin, the block reward compensates miners for their\nservice. In Cosmos also, inflation goes to the validators for their service in\nsecuring the network.</p>\n<p>But, there is a fundamental difference. As a Bitcoin holder, inflation is bad\nfor the holder. The miners are a separate group and every block reduces the\nholder’s relative ownership of the Bitcoin supply. In Cosmos, atom holders\nthemselves provide the security services, and it is they who receive the newly\nissued atoms. The atoms I own may get diluted, but I get a portion of what\ndilutes them.</p>\n<p>You might be asking yourself, ‘is inflation good or bad for the atom holder’?</p>\n<h4 id=\"an-example-scenario\">An Example Scenario</h4>\n<p>Let’s run through an example to see the effects of the inflation rate. We’ll\nassume that 60% of the atoms are bonded. That means the owner is either\nvalidating herself or delegating them to another validator. If the inflation\nrate is 10% per year, the total amount of atoms is increasing by 10% annually\n(regardless of the amount bonded).</p>\n<p>So if Alice had 1% of all the atoms in the beginning and stayed unbonded for a\nfull year, after a year she will have 1% / (1 + 0.1) = 0.91% of the atom\nsupply.  Cosmonaut Bob on the other hand started with 0.5% and validated the\nwhole year.  His share will increase to 0.5% x (1 + 0.1/0.6) = 0.58%. In a\nsteady state equilibrium, that extra 0.08% needs to be enough to pay for the\ncost of running a validator, assuming Bob runs his own validator node. If Bob\nis delegating, the inflationary atoms and transaction fees earned would have to\ncover the validator’s fees. The rewards also need to compensate for the added\nrisk that Bob is taking, since those atoms could get slashed.</p>\n<h4 id=\"staking-token-vs-currency-token\">Staking Token vs Currency Token</h4>\n<p>While the bitcoin token is a currency token intended to be used as a means of\npayment and medium of exchange, the atom is a staking token that is intended to\nbe used as a means of consensus.  They’re more like virtual Bitcoin miners,\nthan the virtual Bitcoin coins themselves.</p>\n<p>In a staking token, we want a significant portion of the staking token holder\nto be “at stake”.  This has security benefits.  If instead, the staking token\nwere also being used as a medium of exchange, then it would be easier to\nacquire a significant share of these tokens relative to the total amount of\nbonded staking tokens.  If on the other hand, the staking token were not as\nliquid as a medium of exchange, an attacker has to incur much steeper costs in\norder to acquire these tokens for an attack.  It may not even be possible.</p>\n<h4 id=\"dynamically-adjustable-inflation-rate\">Dynamically Adjustable Inflation Rate</h4>\n<p>In order to keep the atom a secure staking token, the Cosmos Hub will automatically\nadjust the inflation rate to incentivize a proper amount of staking.</p>\n<p>We don’t know what the optimal formula is for dynamically adjusting parameters like\ninflation, so we will need to figure it out over time.</p>\n<p>For now, we propose a simple formula for dynamically adjusting the inflation rate.</p>\n<ul>\n<li>The minimum inflation rate is 7%.</li>\n<li>The maximum inflation rate is 21%.</li>\n<li>In the beginning, the inflation rate will be 7%.</li>\n<li>If in the past 4 months more than 2/3 of atoms were bonded more than 1/2 of the time, then decrease the inflation rate.</li>\n<li>Otherwise, increase the inflation rate.</li>\n</ul>\n<h4 id=\"governance-and-the-community\">Governance and the Community</h4>\n<p>Finding the right solution will take the whole community to be actively engaged\nin dialog. If you have thoughts on how to design this crypto-economic system,\nreach out to us.  Once the Cosmos Network launches, atom holders can make\nproposals to change how inflation works. On-chain governance means that changes\nare always possible, and that Cosmonauts decide for themselves where to go.</p>\n",
      "excerpt": "An examination of the inflation dynamics in Cosmos.",
      "redirect": "https://blog.cosmos.network/understanding-inflation-in-cosmos-622651c83303",
      "dateFriendly": "2017-04-04"
    },
    {
      "title": "Atom Supply and Distribution",
      "slug": "atom-supply-and-distribution",
      "author": "Brian Fabian Crain",
      "date": 1490745600000,
      "body": "<p>A lot of people have been asking us how many atoms will be created and how they\nwill be distributed. So we thought it would be useful to give an overview and\nrun through a few different scenarios that show what happens at different\nlevels of funding.</p>\n<h4 id=\"scenario-1-usd-102m-raised-in-3-days\">Scenario 1: USD $10.2m Raised in 3 Days</h4>\n<p>If we stay below the USD $10m mark in the first 6 hours, the fundraiser will\ncontinue. In that case, we might hit the cap after a few days and then end the\nfundraiser process. Ending the fundraising process won’t be immediate. Some\npeople will be the middle of the contribution process and they will still be\nable to get their contribution in. So we will overshoot the cap somewhat.</p>\n<p>Here is what the total atom supply and distribution could look like in that\nscenario:</p>\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Amount Raised</th>\n<th>Atoms Allocated</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Early Donors</td>\n<td>USD $300,000</td>\n<td>6,837,467</td>\n</tr>\n<tr>\n<td>Strategic Partners &amp; Pre-Contributors</td>\n<td>USD $1,329,472</td>\n<td>16,856,718</td>\n</tr>\n<tr>\n<td>Fundraiser Participants</td>\n<td>USD $8,570,528</td>\n<td>85,705,280</td>\n</tr>\n<tr>\n<td>Interchain Foundation</td>\n<td></td>\n<td>13,674,933</td>\n</tr>\n<tr>\n<td>All in Bits</td>\n<td></td>\n<td>13,674,933</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td><strong>USD $10,200,000</strong></td>\n<td><strong>136,749,331</strong></td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"scenario-2-usd-125m-raised-in-6-hours\">Scenario 2: USD $12.5m Raised in 6 Hours</h4>\n<p>If a lot of people want to participate in the fundraiser, we could go above the\nUSD $10m mark in the first six hours. In case it went very high, we would end\nthe fundraiser early, even before the six hours are up. But if the amount\nraised exceeds the USD $10m cap by a few million, then we will let it run until\nthe six hours are up and end it then.</p>\n<p>Here is what the total supply and distribution of tokens could look like in\nthat scenario:</p>\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Amount Raised</th>\n<th>Atoms Allocated</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Early Donors</td>\n<td>USD $300,000</td>\n<td>8,370,800</td>\n</tr>\n<tr>\n<td>Strategic Partners &amp; Pre-Contributors</td>\n<td>USD $1,329,472</td>\n<td>16,856,718</td>\n</tr>\n<tr>\n<td>Fundraiser Participants</td>\n<td>USD $10,870,528</td>\n<td>108,705,280</td>\n</tr>\n<tr>\n<td>Interchain Foundation</td>\n<td></td>\n<td>16,741,600</td>\n</tr>\n<tr>\n<td>All in Bits</td>\n<td></td>\n<td>16,741,600</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td><strong>USD $12,500,000</strong></td>\n<td><strong>167,415,997</strong></td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"scenario-3-usd-72m-raised-in-2-weeks\">Scenario 3: USD $7.2m Raised in 2 Weeks</h4>\n<p>It’s also perfectly possible that fewer people want to become cosmonauts and\nthat we won’t reach the USD $10m cap at all. In that case, we will let the\nfundraiser run for two weeks before it ends.</p>\n<p>Here is what the total supply and distribution of tokens could look like in a\nscenario like that:</p>\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Amount Raised</th>\n<th>Atoms Allocated</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Early Donors</td>\n<td>USD $300,000</td>\n<td>4,837,467</td>\n</tr>\n<tr>\n<td>Strategic Partners &amp; Pre-Contributors</td>\n<td>USD $1,329,472</td>\n<td>16,856,718</td>\n</tr>\n<tr>\n<td>Fundraiser Participants</td>\n<td>USD $5,570,528</td>\n<td>55,705,280</td>\n</tr>\n<tr>\n<td>Interchain Foundation</td>\n<td></td>\n<td>9,674,933</td>\n</tr>\n<tr>\n<td>All in Bits</td>\n<td></td>\n<td>9,674,933</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td><strong>USD $7,200,000</strong></td>\n<td><strong>96,749,331</strong></td>\n</tr>\n</tbody>\n</table>\n<p>We hope that will answer some of your questions and give you a better idea of\nhow many atoms will be created under different scenarios. The atom rate that we\nwill recommend for the allocation of fundraiser participants will always be 1\natom per USD $0.1 worth of bitcoins contributed<sup>*</sup>. The more we raise\nthe smaller the percentage of the total atom supply that 1 atom will represent.\nBut then again, the more resources we have to build out the Cosmos Network and\nmake sure it is capable of great cosmic adventures.</p>\n<p><sup>*</sup> <em>The USD/BTC exchange rate will be determined and fixed just prior\nto the fundraiser.</em></p>\n",
      "excerpt": "A lot of people have been asking us how many atoms will be created and how they will be distributed.",
      "redirect": "https://blog.cosmos.network/atom-supply-and-distribution-b4dd3404ff26",
      "dateFriendly": "2017-03-29"
    },
    {
      "title": "New Date: Fundraiser Date Moved to April 6",
      "slug": "new-date-fundraiser-date-moved-to-april-6",
      "author": "The Cosmonauts",
      "date": 1490572800000,
      "body": "<h3 id=\"fundraiser-date-moved-to-april-6-6am-pdt\">Fundraiser date moved to April 6, 6am PDT</h3>\n<p>Many of you have been asking us for more information and updates. The date we\nannounced for our fundraiser is almost here and everybody wants to inspect the\nterms and conditions and look under the hood before embarking on this adventure\nof cosmic proportions.</p>\n<p>Well today, we finally answer your calling with several critical updates:</p>\n<h3 id=\"limitations-on-us-funders-and-elsewhere\">Limitations on US Funders and Elsewhere</h3>\n<p>One of the most frequent questions we have received was whether US persons can\nparticipate in the fundraiser. After all, there is no reason to think that the\nproportion of potential Cosmonauts in the land of the free would be any lower\nthan elsewhere. It would be easy to block US persons and call it a day, but\nthis isn’t a satisfying solution.  So, we spent a lot of time with our lawyers\nto analyze the situation.</p>\n<p>After a series of meetings last week, we’ve finally come to a decision – we’re\nlifting the general ban on US residents and citizens!  We’re super excited\nabout this outcome, and hope you are too.</p>\n<p>We reserve the right to block contributions from certain few states within the\nUS as we discover more about state-level regulations.  The state of Washington\n&amp; New Hampshire are top on the list of states we want to block.  We will\nfinalize any such decisions by Wednesday the 29th.</p>\n<p>We will still take care to block certain countries on the OFAC sanctions list.\nThe full list is <a href=\"https://www.treasury.gov/resource-center/sanctions/Programs/Pages/Programs.aspx\">here</a>.</p>\n<h3 id=\"fundraiser-instructions\">Fundraiser Instructions</h3>\n<p>The flow of our fundraiser has also been finished and is with our security\nauditors, Smart Contract Solutions, for a final review.  They are among the\nmost experienced companies when it comes to the security of cryptocurrency\nfundraisers and have done past security audits of Golem, DFINITY, ether.camp\nand WeTrust. We will be publishing the full fundraiser flow with instructions\non Wednesday, and Smart Contract Solutions will also be publishing their\nsecurity review of the process.</p>\n<p>We got our first review results from Smart Contract Solutions just over a week\nago.  No severe security issues were found, but we did get some great\nrecommendations, so we decided to implement a few improvements.  Not only is our\nnew fundraiser flow now more secure, it’s also much easier to follow.  All you\nneed to do is write down and remember 12 words – and you can even generate\nthese words on an offline computer.</p>\n<p>We’re very happy with this new flow and believe that it’s worth the wait, so\nplease bear with us while we do a final round of audits.</p>\n<h3 id=\"fundraiser-contributor-terms\">Fundraiser Contributor Terms</h3>\n<p>We are also releasing the Cosmos Contribution Terms for the fundraiser. This is\na comprehensive document that outlines the risks, rights and obligations of the\nfundraiser. Anybody planning to participate in the fundraiser needs to\ncarefully review the document. And please let us know if you have any questions\nor comments.</p>\n<p>If we make any further modifications to these terms, we will post a separate\nblog post about the updates, so be sure to check our website prior to the\nfundraiser.</p>\n<p><a href=\"https://github.com/cosmos/cosmos/raw/master/fundraiser/Interchain%20Cosmos%20Contribution%20Terms%20-%20Penultimate%20Draft.pdf\">Cosmos Contribution Terms Penultimate Draft</a></p>\n<h3 id=\"pre-fund-amounts\">Pre-Fund Amounts</h3>\n<p>This journey started quite a long time ago, and without the support of some\nearly, irreverent Cosmonauts, we wouldn’t be here today. Thus, the foundation\nwill recommend allocating a corresponding amount of atoms to those funders.</p>\n<p>First, we received a commitment for USD $300,000 from lead donors in August\n2016. At that time, we didn’t know much about what the Cosmos fundraiser would\nlook like, so we recommended that those early donors be allocated 5% of the total\natom supply for their support.</p>\n<p>Second, we received a number of contributions from pre-contributors and\nstrategic partners. Those are also people who supported the project\nsubstantially earlier and/or are providing crucial support in other areas. We\nraised a total of USD $1,329,472 from these 13 individuals and entities. We did\ngive discounts between 15% and 25% on these contributions. The total amount of\natoms allocated to pre-contributors and strategic partners is 16,856,718.</p>\n<h3 id=\"bug-bounty-program-winners\">Bug Bounty Program Winners!</h3>\n<p>We are happy to announce the three winners of our bug bounty program. They are\nthe ones who dug into the code to find the weaknesses in our fundraiser flows.\nThe winners are:</p>\n<ul>\n<li>\n<p><strong>Denis Milicevic</strong> - for pointing out an issue in our Solidity code for emergency\nETH return addresses.  Thank you Denis, please accept our bounty for 3 bitcoins\nworth of atoms.</p>\n</li>\n<li>\n<p><strong>Piotr</strong> - for independently finding the above issue, but also identifying a\nnon-critical bug wherein the smart contract cannot be killed after being\nhalted.  Thank you Piotr, we’d like to grant you 3 bitcoins or 3 bitcoins’\nworth of atoms.</p>\n</li>\n<li>\n<p><strong>Christopher Goes</strong> - for identifying a UX error in the web wallet backup flow\nwhere we show both a failure and success notification when the wallet backup\nfails for whatever reason.  Thank you Christopher!  We’ve already credited\nChristopher with 3 bitcoins.</p>\n</li>\n</ul>\n<p>When we release the new fundraiser flow on Wednesday, we look forward to\nanother round of public review from the community.  Thank you for your support!</p>\n<h3 id=\"fundraiser-date\">Fundraiser Date</h3>\n<p>The date we had announced for our fundraiser was this Friday, March 31. We\nwould be able to go ahead with this date, but we don’t feel we have given all\nof you enough time to review the terms, familiarize yourselves with the\nfundraising structure and ask your questions. Additionally, the new and\nimproved fundraiser flow needs a new round of review.  For this reason, we\ndecided to push back the date of the fundraiser by six days to Thursday April\n6th, 6am Pacific Time.</p>\n<p>Here are a few other things coming up in the next days:</p>\n<ul>\n<li><strong>Tuesday 3/28</strong> - AmA with Cryptocopia community at 3pm EDT (Slack: <a href=\"http://cryptocopia.slack.com\">cryptocopia.slack.com</a>)</li>\n<li><strong>Wednesday 3/29</strong> - AmA with CoinFund community at 3pm EDT (Slack: <a href=\"http://coinfund.slack.com\">coinfund.slack.com</a>)</li>\n<li><strong>Wednesday 3/29</strong> - Publication of fundraiser flow and instructions</li>\n<li><strong>Thursday 3/30</strong> - Completion of second security audit</li>\n<li><strong>Friday 3/31</strong> - Publication of Cosmos Constitution</li>\n<li><strong>Thursday 4/6</strong> - Cosmos Fundraiser begins!</li>\n</ul>\n<p>We hope you are as excited as we are to get to the end of this long road, to\nstart an even longer cosmos journey.</p>\n",
      "excerpt": "Many of you have been asking us for more information and updates. The date we announced for our fundraiser is almost here.",
      "redirect": "https://blog.cosmos.network/new-date-fundraiser-date-moved-to-april-6-a2214e004fdc",
      "dateFriendly": "2017-03-27"
    },
    {
      "title": "Cosmos Fundraiser Date",
      "slug": "cosmos-fundraiser-date",
      "author": "The Cosmonauts",
      "date": 1489536000000,
      "body": "<blockquote>\n<p>NOTICE: The fundraiser launch date has been moved to <strong>April 6th, 6am PDT</strong>. <a href=\"./fundraiser-delay-announcement-ii\">Learn more</a></p>\n</blockquote>\n<p>We have very exciting news: We are launching the Cosmos fundraiser on <a href=\"https://www.worldtimebuddy.com/?qm=1&amp;lid=5391959,2657908,2643743,1835848&amp;h=5391959&amp;date=2017-3-31&amp;sln=6-7\">March 31st, at 6am PDT</a>. We’d like to thank everybody for being patient with us! We still have work to do before then, and are planning on releasing the following before the fundraiser starts:</p>\n<ul>\n<li>All fundraiser agreement terms</li>\n<li>Instructions for people who are interested in participating</li>\n<li>Information about early contributors</li>\n<li>Our procedure for completing (and shutting down) the fundraiser flow.</li>\n</ul>\n<p>This date is dependent on not finding any show-stopping bugs in the fundraiser flow, and we are still <a href=\"./fundraiser-flow-bounty\">offering bounties</a> for anybody who helps us find issues!</p>\n<p><a href=\"https://cosmos.network/\">Sign up for our newsletter</a> to get all the latest updates and announcements.</p>\n",
      "excerpt": "We have very exciting news - We are launching the Cosmos fundraiser on March 31st, at 6am PDT.",
      "redirect": "https://blog.cosmos.network/cosmos-fundraiser-date-6510c3265486",
      "dateFriendly": "2017-03-15"
    },
    {
      "title": "Think Like a Hacker. Make It Big.",
      "slug": "think-like-a-hacker-make-it-big",
      "author": "The Cosmonauts",
      "date": 1489017600000,
      "body": "<p><em>UPDATE: The ETH Solidity contract has been updated</em></p>\n<p>Ladies and gentlemen, a small appeal to the most scrutinizing eyeballs of our industry.</p>\n<p>Cosmos hasn’t been called ‘Tinder for blockchains’ for no reason. Connecting different blockchains is at the core of our mission. When it came to choosing how to conduct our fundraiser, we naturally chose to accept both BTC and ETH.</p>\n<p>Keeping the fundraiser safe for all parties is critical and dealing with both tokens adds additional surface area for attacks and potential issues. That is why we are extending, as of today, ample rewards for anyone with both the time and skills to really dig into our flows.</p>\n<p>We are offering:</p>\n<ul>\n<li>Exactly <strong>15 BTC</strong> for major, show-stopping bugs found in our fundraiser flow.</li>\n<li>Up to <strong>5 BTC</strong> for minor bugs that won’t kill the fundraiser, but which will be an embarrassment or an inconvenience for either Cosmos or its funders.</li>\n<li>You can also claim your reward in Atoms.</li>\n</ul>\n<p>The materials in question can be found here:</p>\n<ul>\n<li>BTC: <a href=\"https://gist.github.com/mappum/428dc46afba73b2bf8c38f65272704d2\">https://gist.github.com/mappum/428dc46afba73b2bf8c38f65272704d2</a></li>\n<li>ETH: <a href=\"https://github.com/cosmos/fundraiser-lib/blob/afdef65dabc4c058ac6fde73dc44dccfcafd428d/contracts/Receiptor.sol\">https://github.com/cosmos/fundraiser-lib/blob/afdef65dabc4c058ac6fde73dc44dccfcafd428d/contracts/Receiptor.sol</a></li>\n</ul>\n<p>These repositories include both the Web-based fundraiser for Bitcoin, and the Solidity contracts for Ethereum. Both are relevant to this bounty. So this is your chance to put your hacker cap on, think like a deviant and strike it big in the crypto space.</p>\n<p>In the interest of being thorough, our friends at Zeppelin (Smart Contract Solutions) are simultaneously performing an audit for these same materials. Don’t worry, if you independently discover a bug that they also find but haven’t published yet, you may still claim the reward.</p>\n<p>Last but not least, we want to express our thanks to participants in the <a href=\"./cosmos-whitepaper-bounty\">Cosmos Whitepaper Bounty</a>, particularly GitHub user MartyMe, who took the 5 BTC bounty with his excellent contributions to both the DEX and the Hub Block Reward.</p>\n<p>This show is nearly on the road, with just a few more miles to go. We look forward to a successful fundraiser, and to building the Internet of Blockchains with you!</p>\n",
      "excerpt": "Keeping the fundraiser safe for all parties is critical and dealing with both tokens adds additional surface area for attacks and potential issues. That is why are extending, as of today, ample rewards for anyone with both the time and skills to really dig into our flows.",
      "redirect": "https://blog.cosmos.network/think-like-a-hacker-make-it-big-6b41952080f6",
      "dateFriendly": "2017-03-09"
    },
    {
      "title": "Cosmos Whitepaper Bounty",
      "slug": "cosmos-whitepaper-bounty",
      "author": "The Cosmonauts",
      "date": 1487116800000,
      "body": "<p>Out here in Cosmos land, we have been hard at work getting everything prepared\nfor the big fundraiser. We could not be more pleased to see that the vision for\nthe Internet of Blockchains has been slowly catching on in the community,  with\nour research and preparation solidifying nicely as well.</p>\n<p>Pertaining to the fundraiser, we have a sequence of announcements to make in\nthe coming weeks. We would love both your feedback and your assistance to\nensure that we make the fundraiser a success. Ultimately, the goal of\nconnecting the disparate blockchains and enabling moving money seamlessly\nbetween them is substantial, with a number of moving parts, each of some\ncomplexity… Your questions and comments help us to hone our communications,\nhopefully  leading to simpler, clearer explanations of all aspects of this\nCosmos that we will build together.</p>\n<p>In <a href=\"./cosmos-roadmap\">our last post</a>, we wrote about the different components of the Cosmos Network\nand our strategic roadmap. This week we are soliciting your input and\nannouncing the first of two bounties!</p>\n<h2 id=\"whitepaper-bounty\">Whitepaper Bounty</h2>\n<p>The Cosmos whitepaper was published last summer, and we received excellent\nquestions, comments, and general feedback about it. But this was rather\ninformal, and we did not in any way officially onboard the feedback we\nreceived. Today that changes: Before we launch the fundraiser, we want to\ninvite a public review of the whitepaper, really an open line to question our\npremises and our proposed solutions. We know that many of you will have\nbrilliant ideas that we haven’t yet heard, and we want to be certain that the\nCosmos system is not only technically and conceptually bulletproof, but\nabsolutely imbued with the best ideas, from the best minds!</p>\n<p>So of course, we are especially interested in exploring the overall Cosmos\narchitecture; those technical or economic flaws that we might have overlooked.\nBut fear not, the long hours you’ll spend wearing your well-trodden thinking\ncap, brooding over our oh-so-cosmic ideas shall not go unrewarded. For usable\ncontributions, we will give out in aggregate 5 bitcoins. We might award that\nentirely to the best and most shattering contribution, or we may perhaps split\nit out over several different ones. In addition, depending on how your review\naffects your belief in the project, you may choose to receive your reward in\neither bitcoin or in atoms!</p>\n<p>Here are the rules and process:</p>\n<ol>\n<li>Though any platform for discussion may be initially used, all\ncontributions must ultimately be filed formally as GitHub issues.</li>\n<li><strong>The repository for filing is <a href=\"https://github.com/cosmos/cosmos/issues\">https://github.com/cosmos/cosmos/issues</a> and\nyou should tag @jaekwon and @ebuchman.</strong></li>\n<li><strong>Please make your point as descriptive as it needs to be, but no more.  A\nsummary of the concern, followed by a more broad description, is probably\nideal.</strong></li>\n<li>The review begins today, Wednesday the 15th of February, and will run\nuntil Friday February 24th at midnight PST.</li>\n</ol>\n<p>As always, if you have any questions or comments, you can find us on\n<a href=\"http://slack.cosmos.network\">Slack</a>,\n<a href=\"http://reddit.com/r/thecosmos\">Reddit</a>, and/or\n<a href=\"http://twitter.com/cosmos_hq\">Twitter</a>. We look forward to your contributions!</p>\n<p>The Cosmos Team</p>\n",
      "redirect": "https://blog.cosmos.network/cosmos-whitepaper-bounty-d7ad84d434da",
      "dateFriendly": "2017-02-15"
    },
    {
      "title": "Cosmos Roadmap",
      "slug": "cosmos-roadmap",
      "author": "The Cosmonauts",
      "date": 1486598400000,
      "body": "<p>In Cosmos land, we have been hard at work with getting everything ready for the\nbig fundraiser. The Internet of Blockchain meme has been slowly catching on in\nthe blockchain community and the vision has solidified in our research and\npreparation as well.</p>\n<p>We will have a sequence of announcements coming in the next weeks and we would\nlove your help and feedback to ensure that we make the fundraiser a success and\nmost importantly realize the ultimate goal of connecting the disparate\nblockchains and enabling moving money seamlessly between chains.</p>\n<p>In this post, we want to share some information about the components of the\nCosmos network and in what sequence we want to release and prioritize those\ncomponents.</p>\n<h1 id=\"two-funding-milestones\">Two Funding Milestones</h1>\n<p>We are dividing the different components of the Cosmos Network into two\ndifferent parts. The first part is the Cosmos Essential Software and Services.\nIt contains the minimum components needed to make sure that Cosmos works and is\nfunctional.</p>\n<p>While basic functionality is great, there is a lot to do that goes beyond that\nto realize the full vision of Cosmos. Once the basic components have been\nbuilt, we will have another set of projects and components to build to enhance\nthe usefulness, usability and connectivity of the network.</p>\n<h2 id=\"cosmos-essential-software-and-services-cess\">Cosmos Essential Software and Services (CESS)</h2>\n<p>CESS consists of all the software necessary to deploy a minimal network that is\ndeserving of the phrase “Internet of Blockchains”. At its heart lies the Cosmos\nHub, a complete, multi-asset, proof-of-stake blockchain with built-in\ngovernance and support for the <a href=\"https://github.com/tendermint/basecoin/blob/develop/docs/guide/ibc.md\">InterBlockchain Communication (IBC) protocol</a>.\nCESS also includes zones that serve as bridges to the public Bitcoin and\nEthereum networks, as well as a <a href=\"https://github.com/cosmos/cosmos/blob/master/DEX.md\">decentralized exchange (the Cosmos DEX)</a> and an\n<a href=\"https://github.com/tendermint/ethermint/\">Ethermint</a> zone, which runs the full Ethereum state machine on Tendermint\nconsensus.</p>\n<p>There will be five blockchains that launch with the Cosmos Network: Hub, DEX,\nBitcoin-Bridge, Ethereum-Bridge, and Ethermint.</p>\n<p>The Cosmos Hub itself is built using two key pieces: <a href=\"https://github.com/tendermint/tendermint\">Tendermint</a> and <a href=\"https://github.com/tendermint/basecoin\">Basecoin</a>.\nTendermint is the general purpose consensus engine that will be used, at least\ninitially, for all blockchains in Cosmos; it is nearing a production-ready\nstate, and is <a href=\"https://tendermint.com/ecosystem\">already in use by many different organizations</a>. Basecoin is an\n<a href=\"./cosmos-creating-interoperable-blockchains-part-1\">extendable framework</a>\nfor building multi-asset cryptocurrency applications on\nTendermint. It’s under active development and includes many working <a href=\"https://github.com/tendermint/basecoin-examples\">example\nplugins</a>.\nTo build the Hub, we need Basecoin plugins for IBC that will manage\nvalidators and their stake, manage delegators and their stake, slash validators\nthat misbehave, and manage governance. These are in various states of\ndevelopment.</p>\n<p>The Bitcoin and Ethereum bridges will enable Cosmos to interoperate with the\npublic Bitcoin and Ethereum networks through the mechanism of two-way pegs,\nfamiliar to many as <a href=\"https://blockstream.com/technology/\">“sidechains”</a>. These will be sidechains of Bitcoin and\nEthereum, which will enable users to move BTC and ETH to and from the Cosmos\nNetwork. Once in the Cosmos Network, they can be transferred through the Hub to\nother zones, including the decentralized exchange. ETH can also be transferred\nto Ethermint zones, where it can be used to power applications written for the\nEVM, but running on a faster consensus algorithm such as Tendermint.</p>\n<p>Finally, CESS includes wallet software for managing funds, sending transactions\non the Cosmos Network, and participating in governance.</p>\n<p>In summary, the foundational components of the project include:</p>\n<ul>\n<li><a href=\"https://github.com/tendermint/tendermint\"><strong>Tendermint</strong></a></li>\n<li><a href=\"https://github.com/tendermint/basecoin\"><strong>Basecoin Framework</strong></a></li>\n<li><a href=\"https://github.com/tendermint/basecoin\"><strong>Hub</strong> (IBC, PoS/Delegation, Governance)</a></li>\n<li><strong>Bitcoin and Ethereum bridges</strong></li>\n<li><a href=\"https://github.com/cosmos/cosmos/blob/master/DEX.md\"><strong>DEX</strong></a></li>\n<li><a href=\"https://github.com/tendermint/ethermint\"><strong>Ethermint</strong></a></li>\n</ul>\n<h2 id=\"auxiliary-software-and-services\">Auxiliary Software and Services</h2>\n<p>The auxiliary software and services includes tools which contribute greatly to\nthe usability, functionality, and adoption of the Cosmos Network. In\nparticular, we have identified the following elements:</p>\n<ul>\n<li><strong>Blockchain Explorer</strong>: an advanced UI for navigating the Cosmos Network,\nincluding analyzing activity within zones, traffic across zones, the\nperformance of validators, etc.</li>\n<li><strong>Fluidity Smart Contract Framework</strong>: a new programming language\nenvironment for building deterministic and halting programs that can run on a\nblockchain. The intent is to take lessons learned from the design of\nEthereum’s Solidity to provide something equally accessible, and with greater\nsupport for extensibility, testing, and safety.</li>\n<li><strong>Community Events and Support</strong>: funding for meetups around the world and\nparticular events, such as in (but not excluded to) San Francisco, Toronto,\nNew York, Berlin, and Seoul, where many of our developers and community are\nbased.</li>\n<li><strong>Additional Zones</strong>: examples include ZCash, Monero, Bitcoin, and\nothers. Community opinion will inform which zones we build.</li>\n<li><strong>Cosmic Grants</strong>: A program, which awards grants for projects and research\nefforts for advancing the internet of blockchain vision.</li>\n</ul>\n<h1 id=\"development-timeline\">Development Timeline</h1>\n<p>The development timeline for Cosmos is split across five eras: Synthesis,\nAtomic Era, Galactic Era, Planetary Era, and Lunar Era.</p>\n<h2 id=\"synthesis\">Synthesis</h2>\n<p>Synthesis is the period in which the Hub is built. It began over two years ago\nwith the birth of the Tendermint project and continues today with the\ndevelopment of the Basecoin framework and the various plugins necessary to\ncompose the Cosmos Hub.</p>\n<h2 id=\"atomic-era\">Atomic Era</h2>\n<p>The Atomic Era starts roughly 4 months after the completion of the fundraiser.\nIt is marked by the release of an Alpha version of the Cosmos Hub and a\ncorresponding testnet. This includes a working form of the governance,\nproof-of-stake, delegation, and IBC modules, as well as a working wallet for\nmaking transactions on the Cosmos Hub. The testnet will include a genesis state\nderived from the results of the fundraiser, enabling all who participated to\ntest the network.</p>\n<h2 id=\"galactic-era\">Galactic Era</h2>\n<p>The Galactic Era starts roughly 8 months after the completion of the fundraiser\nand is marked by the release of the first production version of the Cosmos Hub\nand the first blockchain to be launched in the Cosmos Network. It also marks\nthe beginning of work on the Bitcoin and Ethereum bridges, as well as the DEX.\nThese zones will be iterated on as newer versions are connected to the hub.</p>\n<h2 id=\"planetary-era\">Planetary Era</h2>\n<p>The Planetary Era starts roughly 12 months after the completion of the\nfundraiser and marks the first period of stability for the Cosmos Network,\nincluding working Bitcoin and Ethereum bridges, and a working decentralized\nexchange. At this point, the focus will shift to usability and extensive\ndocumentation to in order to help new users and developers integrating with the\nCosmos Network. Further details will be announced based on changing conditions.</p>\n<h2 id=\"lunar-era\">Lunar Era</h2>\n<p>It is unclear when the Lunar Era starts, but it is marked by a sublime state of\nmind that results from the satisfaction of the Cosmos Network having reached\nmaturity. Similar to the feeling one would experienced when sipping a cocktail\non a beach and glancing at a coconut tree that has blossomed into its full\nbeauty after a seed planted years before.</p>\n<h1 id=\"conclusion\">Conclusion</h1>\n<p>Development on the Cosmos Essential Software and Services continues at quite a clip,\nand the road ahead is well defined and full of exciting technology.\nWe’re looking forward to building this out with the community and\nmaking the Internet of Blockchains a reality for everyone!</p>\n",
      "redirect": "https://blog.cosmos.network/cosmos-roadmap-28d7a478df51",
      "dateFriendly": "2017-02-09"
    },
    {
      "title": "Fundraiser Delay Announcement",
      "slug": "fundraiser-delay-announcement",
      "author": "Jae Kwon",
      "date": 1486339200000,
      "body": "<p>Dear backers and long term supporters,</p>\n<p>Although February 28th was the most recently cited launch date for our Cosmos\nfundraising event, after careful consideration we’ve decided to push this event\nback a bit further. For the time being, <em>no new date</em> has been set, but we are\nhopeful that we are delayed by less than a single month. Here is why:</p>\n<ol>\n<li>\n<p>After communicating with many of our most committed funders, we have decided\nto accept both Ether (ETH) and Bitcoin (BTC). This is a trickier matter than\nit may seem to be on the surface. In order to do it securely, we <em>must</em>\nperform audits on our fundraiser code, fixing any issues that we find. At\nthe moment we don’t know exactly how long this will take. The initial flow\nwill be finalized by Monday next week (Feb 13th), and promptly delivered to\nauditors. Soon after, we’ll make the code available for public review, and\nprovide bounties for anybody who discovers issues.</p>\n</li>\n<li>\n<p>We <em>must</em> finalize the Cosmos roadmap. In order to finalize the roadmap, we\nare concluding negotiations with interested parties and reviewing financial\ndetails regarding the core Cosmos software. These details should be released\nby Thursday (Feb 9th) for public review.</p>\n</li>\n<li>\n<p>We’ve updated our whitepaper and will be seeking feedback over the coming\ndays. As with the fundraiser code, we are going to post bounties for the\nbest feedback/contributions to the whitepaper. This will be announced\nformally in short order, but if anyone wants to get a head start, the\ncurrent whitepaper is available at\n<a href=\"https://github.com/cosmos/cosmos/blob/master/WHITEPAPER.md\">https://github.com/cosmos/cosmos/blob/master/WHITEPAPER.md</a>. Details about\nthe bounty system will likewise be posted soon at\n<a href=\"https://github.com/cosmos/cosmos/blob/master/BOUNTY.md\">https://github.com/cosmos/cosmos/blob/master/BOUNTY.md</a>.</p>\n</li>\n</ol>\n<p>Some time has passed since we first announced that we are doing the fundraiser.\nI really appreciate everyone who continues to stick with us while we work all\nthe details out. The decision to delay was made after careful consideration; we\nreally want to be absolutely sure everything is going to be as secure as\npossible, leading (hopefully) to a very awesome and successful fundraiser.</p>\n<p>We will announce the new date for the fundraiser two weeks before it goes live.\nYou can check the <a href=\"http://slack.cosmos.network\">Cosmos Slack</a> or\n<a href=\"http://cosmos.network\">subscribe to our newsletter</a> to get updates.</p>\n<p>Thanks again to everyone who has followed and supported our work; this is going\nto be a great year!</p>\n<p>-Jae and team</p>\n",
      "excerpt": "Although February 28th was the most recently cited launch date for our Cosmos fundraising event, after careful consideration we've decided to push this event back a bit further.",
      "redirect": "https://blog.cosmos.network/fundraiser-delay-announcement-602268200894",
      "dateFriendly": "2017-02-06"
    },
    {
      "title": "Final Cosmos Contribution Terms",
      "slug": "final-cosmos-contribution-terms",
      "author": "The Cosmonauts",
      "date": 1486166400000,
      "body": "<p>Last week, we said that if we make any further modifications\nto the Penultimate Draft Cosmos Contribution Terms, we would\npost a separate blog about the update.  Here is that update.</p>\n<ul>\n<li><a href=\"https://github.com/cosmos/cosmos/raw/master/fundraiser/Interchain%20Cosmos%20Contribution%20Terms%20-%20FINAL.pdf\">Cosmos Contribution Terms FINAL</a></li>\n<li><a href=\"https://github.com/cosmos/cosmos/raw/master/fundraiser/Interchain%20Cosmos%20Contribution%20Terms%20-%20FINAL%20-%20REDLINE.docx\">Cosmos Contribution Terms FINAL - REDLINE</a></li>\n</ul>\n<p>No significant changes have been made.</p>\n<ul>\n<li>We explicitly block the state of Washington and New Hampshire from the United States.</li>\n<li>We make note of expected administrative fees for internal tax purposes.</li>\n<li>We set the inflation rate to target 2/3 bonded, rather than 1/2.</li>\n<li>We clarify that the USD $10,000,000.00 cap includes the earlier contributions.</li>\n</ul>\n",
      "excerpt": "A lot of people have been asking us how many atoms will be created and how they will be distributed.",
      "redirect": "https://blog.cosmos.network/final-cosmos-contribution-terms-6e79c69f7a39",
      "dateFriendly": "2017-02-04"
    },
    {
      "title": "Cosmos: Creating Interoperable Blockchains — Part 1",
      "slug": "cosmos-creating-interoperable-blockchains-part-1",
      "author": "Jae Kwon",
      "date": 1484611200000,
      "body": "<blockquote>\n<p>A series on <a href=\"http://cosmos.network/\">Cosmos</a>, the internet of blockchains powered by the <a href=\"http://tendermint.com/\">Tendermint</a> consensus engine. <em>View blog post on <a href=\"https://medium.com/@jaekwon/cosmos-creating-interoperable-blockchains-part-1-2929435ba1fa#.kmwc5d4px\">Medium</a>.</em></p>\n</blockquote>\n<p>There are several ways to create public blockchain applications today. The\nprimary ones are:</p>\n<ol>\n<li><strong>Create your own blockchain from scratch, as Satoshi Nakamoto did.</strong> This\nrequires one to two years of full-time dedicated programming to get a completed\nsystem, and should not be attempted without a very good reason.</li>\n<li><strong>Fork an existing blockchain stack like Bitcoin, as various altcoins such as\n<strong><a href=\"https://github.com/namecoin/namecoin-core\">Namecoin</a></strong> have done.</strong> This\nworks well if the base codebase is well designed to be modular, but that’s\nrarely the case.</li>\n<li><strong>Write a “smart contract” in an on-chain interpreted language such as\n<a href=\"https://solidity.readthedocs.io/en/develop/\">Solidity</a></strong>. This is currently the\nbest option for creating simple public blockchain applications, but it requires\nlearning and debugging two levels of complexity — the virtual-machine bytecode\ninterpreter, and the smart contract language.</li>\n</ol>\n<p>With <a href=\"http://tendermint.com/\">Tendermint</a> we introduced a fourth way of creating\nnew public blockchain applications (and by extension, private/consortium apps as\nwell):</p>\n<p><strong>4. Write a state-machine in any language (e.g. Golang, Python, etc), and plug\nit into Tendermint’s consensus engine.</strong> Tendermint is responsible for p2p\nnetworking, consensus, and transaction broadcasting. After nodes come to\nconsensus on a block, they push it to the state-machine via a unix-socket\nprotocol called <a href=\"https://github.com/tendermint/abci\">ABCI</a> (formerly known as\nTMSP).</p>\n<p>Tendermint solves a lot of problems for blockchains, but when it comes to\n<em>public</em> blockchains, there are additional common concerns that must be\naddressed to provide availability. We must balance the desire to provide\npermissionless and censorship-resistant access with the need to prevent spam and\ndenial-of-service (DoS) attacks. While there are many solutions to this problem,\nthe most common one is to charge a market-rate fee for each transaction. When\nthere is a surge in demand for a blockchain’s resources, the classical\nsupply-vs-demand market mechanism can ensure that your transaction will go\nthrough in a timely manner if you pay a sufficiently high fee, and also that\nsustained DoS attacks will incur significant costs to the attacker.</p>\n<p>Ethereum evolved this concept of transaction fees even further by introducing\nthe transaction <em>gas</em>, which priced each CPU operation and prevented infinite\nfor-loops and CPU-heavy smart contracts from hogging the blockchain’s resources.\nThe user can choose to pay however much they want in <em>fees</em>, and can also set\nthe <em>gas_limit</em> (i.e. CPU-operations limit) of the transaction. The value of\n<em>fees/gas_limit</em> or <em>gas_price</em> is a bid on each CPU-operation. It is the job of\nthe miner to to pack as many transactions into a block as possible such that\n<em>sum(gas_limit) ≤ block_gas_limit</em>, to maximize fee revenue.</p>\n<p>Interestingly, Ethereum chooses to refund a proportion of fees when the\ntransaction does not use all of the gas specified in the <em>gas_limit</em>. This puts\nthe burden of gas-usage prediction on the miner, which may be suboptimal\ncompared to taking all of the fees, and letting the user calculate the expected\n<em>gas_limit</em> themselves.</p>\n<p>Transaction <em>gas</em> is a powerful concept, and can be applied more generally to\nblockchain applications that don’t support an interpreted virtual-machine. For\nexample, the <a href=\"/whitepaper#the-hub\">Cosmos Hub</a> can support\ninter-blockchain (IBC) token-transfer transactions from any Tendermint-powered\nsidechain (aka zone), regardless of the number of validators. (Validators are\nnodes that participate in consensus to commit blocks). And yet, the more\nvalidators there are in the zone, the more signatures there will be in the\nblock-hash commit of an IBC transaction. We can solve this with gas such that\ninteroperating with blockchains with larger validator-sets costs more. (Of\ncourse we could also solve this with <a href=\"https://pdfs.semanticscholar.org/be29/fa28770bdbbe3d6962d82ab8744658fbfd39.pdf\">cryptographic threshold multi-signature\nalgorithms</a>,\nbut the same concept applies for IBC transactions that require a long\nMerkle-proof).</p>\n<p>Taking the lessons on transaction gas that we’ve learned in implementing the\nEthereum virtual-machine (which got integrated into ErisDB), we’ve implemented a\ntoy cryptocurrency project called\n<a href=\"https://github.com/tendermint/basecoin\">Basecoin</a> that will become the basis\nfor the Cosmos Hub. Basecoin (not to be confused with the excellent service\n<a href=\"http://coinbase.com/\">Coinbase</a>) is so named because its goal is to become a\nbasis layer for Tendermint-based cryptocurrency applications. It is a\nmulti-asset system at its core, and is intended to accommodate a wide variety of\napplications from simple cryptocurrencies to complex systems like Ethereum.</p>\n<pre><code>// A Basecoin user account\ntype Account struct {\n  PubKey   crypto.PubKey\n  Sequence int\n  Balance  Coins\n}\n\ntype Coin struct {\n  Denom  string // e.g. &quot;BTC&quot;, &quot;ATOM&quot;\n  Amount int64\n}\n\ntype Coins []Coin\n</code></pre>\n<figcaption>Basecoin accounts are natively multi-asset</figcaption>\n<p>Basecoin by default provides the ability to send coins from multiple inputs to\nmultiple outputs with the <em>SendTx</em> transaction. Inputs and outputs are\nEthereum-style accounts (rather than UTXOs), so it’s quite a flexible system.</p>\n<p>But what’s more interesting is the secondary kind of transaction, the <em>AppTx</em> transaction. <em>AppTx</em> transactions are processed by a programmer-provided plugin\nmodule. The interface of a Basecoin plugin can be seen below.</p>\n<pre><code>type Plugin interface {\n    // Name of this plugin, should be short.\n    Name() string\n  \n    // Run a transaction from ABCI DeliverTx\n    RunTx(store KVStore, ctx CallContext, txBytes []byte) (res abci.Result)\n  \n    // Other ABCI message handlers\n    SetOption(store KVStore, key string, value string) (log string)\n    InitChain(store KVStore, vals []*abci.Validator)\n    BeginBlock(store KVStore, height uint64)\n    EndBlock(store KVStore, height uint64) []*abci.Validator\n}\n\ntype CallContext struct {\n    CallerAddress []byte   // Caller's Address (hash of PubKey)\n    CallerAccount *Account // Caller's Account, w/ fee &amp; TxInputs deducted\n    TxInput       Coins    // The coins that the caller wishes to spend, excluding fees\n}\n</code></pre>\n<figcaption>The Basecoin Plugin interface</figcaption>\n<p>The important function is the <em>RunTx</em> interface method, which is what you need\nto implement in order to extend Basecoin with any functionality you want,\nwhether it be IBC coin-transfer, or an EVM smart-contract call. Perhaps you’d\nlike to program an entirely new smart-contract system based on a novel\nvirtual-machine design. The simplicity of the <em>RunTx</em> interface makes it easy to\nget started. Behind the scenes, updates to the <em>KVStore</em> get Merkle-ized and\npersisted to disk automatically. And of course you don’t need to worry about\ncomplicated networking and consensus logic because Tendermint takes care of that\nfor you.</p>\n<p>Basecoin is still a work-in-progress, and it’s (back) in active development. If\nyou feel like hacking Basecoin, check out our <a href=\"http://slack.cosmos.network/\">Slack #basecoin\nchannel</a> and give us a holler!</p>\n",
      "excerpt": "Part 1 of a series on Cosmos, the internet of blockchains powered by the Tendermint consensus engine.",
      "redirect": "https://blog.cosmos.network/cosmos-creating-interoperable-blockchains-part-1-2e7b747515d0",
      "dateFriendly": "2017-01-17"
    },
    {
      "title": "Why We Are Building the Internet of Blockchains",
      "slug": "why-we-are-building-the-internet-of-blockchains",
      "author": "Jae Kwon & Ethan Buchman",
      "date": 1483574400000,
      "body": "<p>One of the great tragedies of cryptocurrencies has been the failure to\ninteroperate with one another.  Cryptocurrency platforms are competing for\ndominance with their own, largely incompatible technical roadmaps. It’s as if\neach blockchain consensus system with its own community is too sovereign for\nits own good.</p>\n<p>Mechanisms like <a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">atomic swaps</a> between chains can\ncertainly help to link communities. However, where there are no technical\nissues, they often suffer from a need for mature liquidity markets and active\nparticipants on each side. Thus the “altcoin” ecosystem is an alchemical soup\nof enthusiasts experimenting in various ways. Many possess new designs and\nconvictions, yet often each stands alone, siloed by the lack of a general\ninter-blockchain communication system.</p>\n<p>Ethereum sought to address this problem, somewhat indirectly, by inventing a\nnew platform for computation. Ethereum allows arbitrary financial systems to be\nwritten against a common virtual machine using a common development\nenvironment. Presuming all new cryptocurrencies launch on Ethereum, they will\nhave some capacity for interoperability.</p>\n<p>Ethereum is in fact a wonderful idea. Its design decisions are motivated by\nimportant considerations such as the need for a simple specification and\nguaranteed determinism. However, it neglects elements such as the difficulty of\ndesigning a secure general purpose programming environment. This means Ethereum\nhas its own sovereignty problem, as it excludes developers who want access to\nthe platform but want alternatives to the current <a href=\"https://en.wikipedia.org/wiki/Finite-state_machine\">state transition machine</a>.</p>\n<p>Ethereum also doesn’t address the problem of turning fiat currency into\nfungible tokens, short of having banks and government bodies issue currency on\nEthereum itself. While many institutions are investigating the Ethereum\nblockchain, there are both scalability and governance concerns which ultimately\nrestrict full-scale adoption. This may impede integration with existing systems\nand currencies.</p>\n<p>Much like communities, companies and nation-states, each existing\ncryptocurrency is born with the seed of some cultural ideal. Bitcoin is\ndecidedly libertarian, with a slight anarchist leaning. Ethereum is less a\npolitical statement and more an avant-garde academic exercise in distributed\nsystems, computer science and contract theory. Dogecoin is a testament to the\ncapacity for humans to bond over the absurd, a phenomenon more commonly known\nas “being social”. Steem offers a more structured version of this same\nbehavior, with a basis in content production and curation.</p>\n<p>And so on, down the line. But there are many more viewpoints in the world, each\ndoubtlessly wanting a unique experiment in the intersection between governance,\nculture and economics. It would be a tragedy for all these experiments to be so\nrigidly siloed from one another by great chasms of incompatibility.</p>\n<p>Clearly, what is needed is something that can integrate the states of existing\nblockchains. Something that can interface in a sane manner with everything from\nnovelty rewards points to currencies issued by nation-states. Something for\nformalizing relationships between systems, without compromising independence.\nSomething with extreme flexibility without compromising security.</p>\n<p>Enter Cosmos, the “Internet of Blockchains”. Cosmos is a network and a\nframework for interoperability between blockchains. It consists of a web of\nhubs and zones, where each zone is effectively an independent blockchain with\nan arbitrary cryptocurrency design (such as Bitcoin, Ethereum, ZeroCash,\nCryptoNote, your local banking institution, etc.). Each hub is a multi-asset\ncryptocurrency that facilitates interoperability between some set of zones.</p>\n<p>Hubs and zones are powered by the Tendermint Proof-of-Stake (TMSP) consensus\nalgorithm, using the TMSP interface to host applications written in any\nprogramming language. TMSP permits enormous flexibility in application design\nand enables the application to inherit the security features of a\nTendermint-powered blockchain. In fact, Cosmos is compatible with any Byzantine\nFault Tolerant system, which is the basis of Tendermint itself.</p>\n<p>Zones communicate with one another through a hub, primarily in the form of\nasymmetric transfer of some set of tokens from one zone to another.\nEffectively, a hub is a blockchain with many sidechains, but using PoS instead\nof PoW leads to a dramatic reduction in overhead without sacrificing security.\nEach zone acts as a light client for the hub, and the hub acts as a light\nclient for all its zones. Tendermint makes this efficient with compact light\nclient proofs that are secure so long as the validator set is known. This can\nbe achieved by ensuring the light client synchronizes with validator set\nchanges at least as often as they are permitted to occur.</p>\n<p>Cosmos makes no distinction between hubs. There is no top hub and the most\npopular or successful hub is a matter of adoption by zones. Furthermore, there\nis no fundamental distinction between zones and hubs, such that any zone with\nsufficient functionality can become a hub. Cosmos will release one particular\nhub in order to get things started, the aptly named Adam hub. There is nothing\nstopping this hub from becoming obsolete, or stopping the likes of Bitcoin or\nEthereum from competing with it and potentially replacing it.</p>\n<p>Cosmos thus introduces a new kind of market dynamic that formalizes the\nfriction points between various cryptocurrency offerings. It demolishes\nbarriers to interoperability by enabling competition between hubs to contribute\nto the economic security of each hub itself. Validators who misbehave will be\nabandoned for better behaving ones. The result is a heterogeneous network – an\nInternet of Blockchains – adapting for each community and each locale\naccording to its needs, all while retaining a backbone of interoperability. The\ngoal is keeping barriers to entry low while holding stewards of the system\naccountable.</p>\n<p>Cosmos’ potential is building synergy and unlocking the power that exists in\nevery cryptocurrency. As operators in one particular echo chamber of consensus\nsystems design, Cosmos believes interoperability is the key to unlocking the\ncollective developments of this industry. With the Internet of Blockchains,\ncompanies and individuals can utilize the services of one chain, without\nabandoning their existing investments in another. This creates a world that is\nfairer, more functional and better secured. This is a call for an end to echo\nchambers, and the beginning of bridge-building.</p>\n",
      "excerpt": "Cosmos is a culmination of lessons of prior cryptocurrencies. It's designed to be extended to incorporate future innovations. It's a distributed ledger platform suitable for generations to come.",
      "redirect": "https://blog.cosmos.network/why-we-are-building-the-internet-of-blockchains-6e38f379669",
      "dateFriendly": "2017-01-05"
    },
    {
      "title": "BFT: The Most Secure Proof-of-Stake",
      "slug": "bft-the-most-secure-proof-of-stake",
      "author": "Jae Kwon",
      "date": 1479168000000,
      "body": "<p>Bitcoin brought the world’s attention to the blockchain. But alas, the Bitcoin\nversion of blockchain isn’t sufficient for the world’s blockchain needs. That\nis because Bitcoin’s proof of work (PoW) consensus <a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">requires an enormous amounts\nof energy</a>. In addition, transactions are painstakingly slow, taking an hour or\nlonger to commit. And because PoW miners have little incentive to be loyal to\none chain or other, upgrades are difficult to coordinate.</p>\n<p>We need an approach to manage blockchains securely that does not impose a huge\nenergy cost on our planet. That approach is Byzantine fault-tolerance\n(BFT)-based <a href=\"https://bitcointalk.org/index.php?topic=27787.0\">proof-of-stake</a> (PoS).  We call it BFT-PoS.</p>\n<p>Before I delve into the merits of BFT-PoS, let me first address the concept of\nByzantine faults without going into confusing detail about <a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport’s General\nand his armies</a>.</p>\n<p>In a distributed system, where data is replicated across hundreds or thousands\nof nodes, there needs to be some type of fault-tolerance or consensus\nalgorithm, for the simple fact that computers break down or go offline from\ntime to time. So if a portion of those nodes fail, the system as a whole still\nneeds to reach a consensus.</p>\n<p>Standard fault-tolerant consensus algorithms like\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a> and\n<a href=\"https://en.wikipedia.org/wiki/Paxos_(computer_science)\">Paxos</a> assume that\nwhen a node fails, it simply stops working and doesn’t send back a reply.\nGoogle, Facebook, and some existing database products already use this family\nof consensus algorithms within their firewalls to ensure that services remain\navailable despite faulty computers.</p>\n<p>But these algorithms aren’t suitable for public blockchains, because there is\nno firewall in a public blockchain.  Anyone with mining power (in PoW) or\nstaking tokens (in PoS) can participate, or even try to sabotage the network.\nTo reach consensus on a public blockchain, we need Byzantine fault-tolerance.\nIn a Byzantine fault, the faulty node can behave in a completely arbitrary\nmanner. Nodes can even collude to try and maximize the damage they cause.</p>\n<p>So essentially, the purpose of a BFT consensus algorithm is to establish trust\nbetween otherwise unrelated parties over an untrusted network like the\nInternet.</p>\n<p>BFT is nothing new. The concept was first introduced in an academic paper by\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport, Shostak, and Pease in\n1982</a>. But\nLamport et al only demonstrated the theoretical feasibility of the algorithm in\na synchronous environment, where all the messages always arrive on time.</p>\n<p>But in the real world, you can’t really trust the Internet to deliver anything\non time. So in 1988, <a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork, Lynch, and Stockmeyer</a> (DLS) proposed an algorithm\nthat works in mostly asynchronous environments.  Later in 1999, <a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\nand Barbara Liskov</a> proposed a practical solution for continuous BFT consensus\nthat was, and still is today, the state-of-the-art in BFT algorithms.</p>\n<p>But for a long time, the mainstream press ignored these seminal works. Nobody\nunderstood the importance of BFT outside academia and major institutions like\nIBM and DARPA, until 2009 when Bitcoin came along. Bitcoin was the first open\ndecentralized application to provide BFT consensus on a global currency ledger,\nbut using a completely novel solution to the Byzantine general’s problem: PoW.</p>\n<p>In PoW, miners compete, based on who has the most processing power, to validate\ntransactions. And for their efforts they are rewarded with transaction fees and\nnewly minted bitcoins. This is how Bitcoin creates new currency.  Bitcoin\nminers around the globe compete in a lottery-like system for these newly issued\nbitcoins, and the efficient market makes it so that the cost of the energy used\nby the global mining network is on the order of the block reward (plus\ntransaction fees).  Today, that turns out to be around $1M worth of electricity\nper day.  In addition, Bitcoin mining is being commoditized by <a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">large data\ncenters in places of the world where electricity is more affordable</a>, making it\ndifficult for laymen to participate.</p>\n<p>PoS, on the other hand, does away with the energy dependence of PoW entirely.\nIn PoS, miners are replaced with “validators” who have a stake in the system.\nValidators don’t have to invest in expensive processing systems but they do\nhave to purchase “staking tokens.” Any normal laptop will suffice to solve the\nalgorithm.</p>\n<p>Peercoin, <a href=\"https://bitshares.org/\">BitShares</a>,\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a>, and others already use some form of\nPoS, and Ethereum is planning a move to PoS in the near future. Yet, while PoS\nmakes practical sense, many people have <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">rallied against the use of\nPoS</a>, claiming it is\nimpossible to secure. But that is simply not true. Using BFT, you absolutely\ncan secure PoS.  It’s just that we haven’t seen any BFT-PoS public blockchains\nyet.</p>\n<p>While the theory may be difficult to explain or understand, the ultimate\nresults provided by proper BFT algorithms are simple to grasp.  Unlike PoW\nblockchains, BFT-PoS blockchains do not fork (i.e. get double-spend attacked)\nat all unless ⅓ or more validators coordinate such an attack.  And, when 1/3 or\nmore validators do cause a double-spend attack, we can computationally\ndetermine which validators were responsible for the attack, destroy their\nstaking tokens and eject them from the network.  It’s as if the staking tokens\nare virtualized PoW miners that blow up when used to attack the system.  No\nother blockchain consensus algorithm, including PoW, can provide the level of\ncollateralization that is possible with BFT-PoS.</p>\n<p>BFT-PoS performs extremely well. Today, in global public blockchain with a few\nhundred validators, you can get transaction finality on the  order of 3\nseconds, easily – no need to wait for additional block confirmations! The\ntheory has proven to us that these are optimal fault-tolerance thresholds for\n“instant-finality” blockchains.  While more validators does slow down\nconsensus, if <a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">Nielsen’s\nlaw</a> continues to hold,\nwe’ll even be able to support an exponentially increasing number of validators\nevery year with the same performance.</p>\n<p>In addition, BFT-PoS will also increase the security of mobile wallets. Few of\nthe mobile wallets in existence today take full advantage of the security\noffered by Bitcoin, for the simple fact that nobody is willing to wait an hour\nfor a transaction to clear. Instead, most wallets just assume that <a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">the person\nsending the money isn’t trying to double spend\nit</a>.\nAnd, though we don’t have time to dive into it here, efficient mobile wallet\nprotocols, or “light client SPV” protocols are the key to future blockchain\ninteroperability.</p>\n<p>While PoW worked well for Bitcoin, it’s costly, slow, and environmentally\nunfriendly. The best alternative out there right now is BFT-PoS. It’s an\nenduring, energy efficient solution that works well in asynchronous\nenvironments. And best of all, because BFT was developed by the best and the\nbrightest in the computer science industry, it’s provably secure. You can’t do\nany better than that.</p>\n",
      "excerpt": "Many people have rallied against the use of PoS, claiming it is impossible to secure. But that is simply not true. Using BFT, you absolutely can secure PoS.  It’s just that we haven’t seen any BFT-PoS public blockchains yet.",
      "redirect": "https://medium.com/cosmos-blockchain/bft-the-most-secure-proof-of-stake-9d79aceef099",
      "dateFriendly": "2016-11-15"
    }
  ],
  "ko": [
    {
      "title": "Why We Are Building the Internet of Blockchains",
      "slug": "why-we-are-building-the-internet-of-blockchains",
      "author": "Jae Kwon & Ethan Buchman",
      "date": 1483574400000,
      "body": "<p>우리는 블록체인이 공동의 합의원장 규칙 안에서 자발적으로 모인 경쟁과 선택의 자유를 가진 개인들을 통해 공공의 이익을 일구어낼 수 있다고 믿습니다. 이전 암호화폐들의 성공과 실패에서 중요한 교훈을 얻었으며, 이를 바탕으로 우리만의 혁신을 일궈냈습니다. 속도, 보안성, 확장성 그리고 사용성 모두를 확보한 새로운 시대를 열 것입니다.</p>\n<p>코스모스(Cosmos)는 그러한 배움과 혁신들의 정점이며, 미래에 다가올 혁신까지도 자유로이 수용할 수 있는 암호화폐 플랫폼입니다.</p>\n<hr>\n<p>현재 암호화폐의 가장 큰 비극 중 하나는 암호화폐가 기존 시스템과 상호운용이 불가능하며, 심지어 암호화폐들 자체 간에도 상호운용이 어렵다는 점이다. 각 화폐는 자체 블록체인과 자체 커뮤니티를 가지고 각자 도생하며 지나치게 독립적이다. 이 문제는 비트코인 첫 구매 시부터 확연히 드러난다: 인터넷 화폐를 인터넷을 통해 구입하는 것이 너무나 어려우며, 엄청난 양의 정보를 연구해야 하고 알지도 못하는 제 3자인 거래소에서 거래를 승인받고 거래가 완료되기까지는 몇 주가 걸리기도 한다. 게다가 그러한 거래소는 믿을 수 없으며 많은 금액을 맡기지 않는 것이 안전하다.</p>\n<p>블록체인 간의 <a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">Atomic Swap</a>과 같은 기능은 각 커뮤니티를 연결해줄 수 있긴 하지만, 긴 타임아웃과 양 코인 무도가 충분한 시장 유동성이 필요하다는 한계점이 있다. <a href=\"https://coinmarketcap.com/\">알트코인 생태계</a>는 선구자들이 새로운 암호화폐들을 실험하는 장으로 사용되어 왔다. 하지만 각 알트코인은 독립적이며 베타적으로 자신만의 생태계에 고립되어 있고, 많은 경우 작업증명(PoW)으로 대량의 전기를 낭비한다.</p>\n<p>이더리움(Ethereum)은 이 문제를 다양한 금융 서비스를 설계할 수 있는 플랫폼을 제공함으로써 다소 간접적인 해결책을 제시한다. 만일 모든 암호화폐가 이더리움 위에 런칭한다면 서로 상호운용이 가능할 것이다. 이더리움은 훌륭한 아이디어이고, 설계적인 부분에서 ‘단순한 스펙(simple specification)’이나 ‘결정성 보장(determinism guarantee)’과 같은 중요한 부분들을 고려했다. 하지만 상당히 많은 다른 부분들에서는 소홀함을 보인다. 예를 들어, 이더리움에서는 상용 서비스를 위한 프로그램보안을 설계하기가 까다롭다. 또한 현재 이더리움에서 자체적으로 제공하는 상태변환머신(state transition machine) 외에 다른 대안을 사용할 수 없다는 점에서 역시 고립성 문제를 지니고 있다.</p>\n<p>또한 이더리움은 은행이나 정부 등의 기관이 화폐를 이더리움 위에서 발행하지 않는 한, 결국 법정화폐를 이더로 전환해서 사용해야 한다는 제약도 가진다. 여러 기관들이 이더리움 블록체인을 연구하고는 있지만(<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">참조기사1</a>, <a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">참조기사2</a>), 여전히 확장성 문제(scalability)나 거버넌스(governance, 경영)에 대한 우려가 있다. 따라서 이더리움을 그대로 기존 시스템이나 화폐에 적용하거나 통합시키기는 어렵다.</p>\n<p>현재 각 암호화폐는 고유한 문화적 이상(Cultural Ideal)을 가지고 있다. 비트코인의 경우 분명한 ‘자유주의적(libertarian)’ 성격과 약간의 ‘무정부주의(anarchist)’적인 부분이 있으나, 작업증명(PoW) 방식이 가지는 경제구조 때문에 근본적으로는 성취될 수 없다. 이더리움은, 보다 덜 정치적이며, 분산시스템, 컴퓨터과학, 계약설(contract theory: 국가권력이 인간들의 계약에 기초한다는 학설)에서의 전위적인 학문적 실험(avant garde academic excercise)이다. 도지코인(Dogecoin)은 사람들이 바보같고 유머스러운 것(the absurd)을 위해서도 단합하는 모습을 보여줌으로써 인간의 사회성을 잘 드러내준다. 스팀(Steem)은 컨텐츠의 생성과 배포(curation)에 기반하여, 보다 더 구조적으로 발현되는 인간의 사회성을 보여준다. 그 외에도 다양한 암호화폐들이 있다. 더욱 다양한 이념을 가진 코인들이 생겨날 수 있으며, 여러가지의 가상머신(VM)들도 시도될 것이다. 각각을 통해 거버넌스, 문화, 경제간 교집합에 대한 새로운 실험들이 이루어질 수 있다. 이러한 모든 실험들이 융통성없이 독립적으로만 수행된다면 너무나 안타까울 것이다.</p>\n<p>분명히, 우리가 필요한 것은 이더리움보다는 더 포용적인(general) 모델이다. 일종의 ‘메타 이더리움(meta-Ethereum)’인 셈인데, 1) 기존 코드베이스와 블록체인들의 상태를 통합할 수 있고, 2) 정상적인 방식으로 국가별 법정화폐와 연결이 가능하며, 3) 암호화폐간의 관계를 위한 형식을 정립(formalize)하고 각각의 독립성을 해치지 않으면서 서로를 연결하며, 4) 보안성을 약화시키지 않으면서도 극단적 수준의 유연함까지 갖춘 모델이다.</p>\n<p>코스모스(Cosmos)가 바로 그것이다. 코스모스는 블록체인간 상호운용성을 가능케하는 네트워크이자 프레임워크(framework)다. 코스모스는 ‘허브(hub)’들과 ‘존(Zone)’들의 웹(web)으로 이루어져 있는데, 각 ‘존(zone)’은 비트코인(Bitcoin), 이더리움(Ethereum), 제로캐시(ZeroCash), 크립토노트(CryptoNote)와 같이 고유한 암호화폐 디자인을 가진 독립된 개개의 블록체인을 가리키며, 각 ‘허브(hub)’는 ‘다중 토큰 시스템(a multi-token system)’으로 존들(set of zones) 간의 상호운용(Interoperability)을 가능하게 한다.</p>\n<p>허브와 존은 ‘<a href=\"http://tendermint.com/\">텐더민트</a> <a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">지분증명 합의알고리즘</a>(Tendermint PoS consensus algorithm)’에 의해 활성화되며, <a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP 인터페이스</a>를 사용하여 어떤 프로그래밍 언어로 쓰인 어플리케이션이든 상관없이 호스팅할 수 있다. TMSP를 통해 엄청난 자유도의 어플리케이션 설계가 가능하며, 어플리케이션이 텐더민트 기반 블록체인의 보안적 특성(security features of a Tendermint-powered blockchain)도 활용할 수 있도록 한다.</p>\n<p>존(zone)들은 허브(hub)를 통해 서로 소통하는데, 주로 각 존들이 서로 한 묶음의 토큰(some set of tokens)을 비대칭 전송(asymetric transfer)함으로 그렇게 한다. 사실상, 허브는 다수의 <a href=\"https://blockstream.com/sidechains.pdf\">사이드체인</a>을 가진 단일한 블록체인이라고 정의할 수 있고, PoW대신 PoS(Proof-of-Stake, 지분증명)방식을 사용하기 때문에 보안성을 유지하면서도 간접비용(채굴비용)은 획기적으로 절감한다. 방법론적으로는 각 존은 허브를 위한 라이트 클라이언트(light client) 역할을 하며, 마찬가지로 허브도 존들의 라이트 클라이언트 역할을 하는 것이다. 텐더민트는 ‘<a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">컴팩트 라이트 클라이언트 증명(compact light client proofs)</a>’을 통해 효율적으로 이 역할을 수행하는데, 가장 최근의 정확한 발리데이터 세트(validator set)가 알려져 있는 상태에서, 발리데이터 세트 내용이 변경될 때마다, 라이트 클라이언트가 이를 <a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">동기화</a>함으로 보안성을 확보하는 것이다.</p>\n<p>많은 사람들이 지분증명(PoS)을 안전하지 않은 방식이라며 <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">반대</a>하고 있다. 하지만 동시에, 단일한 PoW체인을 통해 복수의 PoS체인들의 보안성을 획득하는 것도 큰 의미가 없음을 인정한다. 텐더민트 개발자인 <a href=\"https://twitter.com/buchmanster/status/738550345597648896\">Ethan Buchman</a>은 궁극적으로 PoW체인은 하나여야만 하고, 반면에 PoS는 각 암호화폐, 보상시스템, 또는 존재하는 다양한 토큰들 기반 시스템에 맞추어 수천, 수백만개가 되어야 한다고 생각한다.</p>\n<p>코스모스(Cosmos) 위에서 각 허브들은 동등한 지위를 가진다. 최상위 허브(top hub)와 같은 개념은 존재하지 않으며, 허브의 성공이나 명성은 얼마나 많은 존(zone)들에게 선택받느냐에 달려있다. 엄밀히 말하면, 존(zone)과 허브(hub)도 근본적인 차이는 없다. 어느 존이든 충분한 기능을 갖춘다면, 허브가 될 수 있다. 우선은 생태계를 조성하기 위해 텐더민트에서 자체적으로 허브(Adam hub, 아담허브)를 런칭할 것이지만, 언제든지 다른 허브가 등장할 수 있으며, 비트코인이나 이더리움 같은 허브이든, 아니면 그 자체이든 얼마든지 아담과 경쟁하고 아담을 대체할 수 있다.</p>\n<p>코스모스(Cosmos)은 다양한 암호화폐들 간의 장벽을 해소하고 새로운 역학관계를 만들어낼 것이다. 또한 허브들 간의 경쟁을 촉진하고 경제적인 안정을 도모하도록 유도한다. 부정행위를 하고자 하는 발리데이터(Validator, 유효성 검사자: 비트코인의 채굴자과 유사한 역할-합의구조 유지)들은 시스템 안정성에 기여하는 다른 발리데이터에 의해 대체될 것이다. 결과적으로는, 다양한 네트워크들이 코스모스 위에서 공존할 것이고, 각 필요에 따른 커뮤니티와 필요에 따른 공간이 개별적으로 존재하면서도 동시에 근간이 되는 시스템에서 이들 간의 상호운용(interoperability)이 가능하도록 만들 것이다. 이러한 특성을 통해 접근성을 높이면서 시스템 안정성과 서비스의 질도 함께 높이게 될 것이다.</p>\n<p>새로운 암호화폐를 위한 ‘시험장’으로써든, 기존 암호화폐를 ‘개선’시키기 위해서든 또는 ‘탈중앙화된 거래소’나 확장성이 보장된 ‘스마트컨트랙트를 위한 플랫폼’으로써 사용하든 ‘코스모스(Cosmos)’의 잠재력은 곧, 존재하는 모든 암호화폐들의 잠재력이며, 시너지를 통해 더 큰 잠재력을 발휘할 수 있다. 정말 필요한 질문은, ‘과연 당신은 여기에 무엇을 만들 것인가’이다.</p>\n",
      "excerpt": "Cosmos is a culmination of lessons of prior cryptocurrencies. It's designed to be extended to incorporate future innovations. It's a distributed ledger platform suitable for generations to come.",
      "dateFriendly": "2017-01-05"
    }
  ]
}