{
  "en": [
    {
      "title": "BFT: The Most Secure Proof-of-Stake",
      "slug": "bft-the-most-secure-proof-of-stake",
      "author": "Jae Kwon",
      "date": 1479168000000,
      "body": "<p>Bitcoin brought the world’s attention to the blockchain. But alas, the Bitcoin\nversion of blockchain isn’t sufficient for the world’s blockchain needs. That\nis because Bitcoin’s proof of work (PoW) consensus <a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">requires an enormous amounts\nof energy</a>. In addition, transactions are painstakingly slow, taking an hour or\nlonger to commit. And because PoW miners have little incentive to be loyal to\none chain or other, upgrades are difficult to coordinate.</p>\n<p>We need an approach to manage blockchains securely that does not impose a huge\nenergy cost on our planet. That approach is Byzantine fault-tolerance\n(BFT)-based <a href=\"https://bitcointalk.org/index.php?topic=27787.0\">proof-of-stake</a> (PoS).  We call it BFT-PoS.</p>\n<p>Before I delve into the merits of BFT-PoS, let me first address the concept of\nByzantine faults without going into confusing detail about <a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport’s General\nand his armies</a>.</p>\n<p>In a distributed system, where data is replicated across hundreds or thousands\nof nodes, there needs to be some type of fault-tolerance or consensus\nalgorithm, for the simple fact that computers break down or go offline from\ntime to time. So if a portion of those nodes fail, the system as a whole still\nneeds to reach a consensus.</p>\n<p>Standard fault-tolerant consensus algorithms like\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a> and\n<a href=\"https://en.wikipedia.org/wiki/Paxos_(computer_science)\">Paxos</a> assume that\nwhen a node fails, it simply stops working and doesn’t send back a reply.\nGoogle, Facebook, and some existing database products already use this family\nof consensus algorithms within their firewalls to ensure that services remain\navailable despite faulty computers.</p>\n<p>But these algorithms aren’t suitable for public blockchains, because there is\nno firewall in a public blockchain.  Anyone with mining power (in PoW) or\nstaking tokens (in PoS) can participate, or even try to sabotage the network.\nTo reach consensus on a public blockchain, we need Byzantine fault-tolerance.\nIn a Byzantine fault, the faulty node can behave in a completely arbitrary\nmanner. Nodes can even collude to try and maximize the damage they cause.</p>\n<p>So essentially, the purpose of a BFT consensus algorithm is to establish trust\nbetween otherwise unrelated parties over an untrusted network like the\nInternet.</p>\n<p>BFT is nothing new. The concept was first introduced in an academic paper by\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport, Shostak, and Pease in\n1982</a>. But\nLamport et al only demonstrated the theoretical feasibility of the algorithm in\na synchronous environment, where all the messages always arrive on time.</p>\n<p>But in the real world, you can’t really trust the Internet to deliver anything\non time. So in 1988, <a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork, Lynch, and Stockmeyer</a> (DLS) proposed an algorithm\nthat works in mostly asynchronous environments.  Later in 1999, <a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\nand Barbara Liskov</a> proposed a practical solution for continuous BFT consensus\nthat was, and still is today, the state-of-the-art in BFT algorithms.</p>\n<p>But for a long time, the mainstream press ignored these seminal works. Nobody\nunderstood the importance of BFT outside academia and major institutions like\nIBM and DARPA, until 2009 when Bitcoin came along. Bitcoin was the first open\ndecentralized application to provide BFT consensus on a global currency ledger,\nbut using a completely novel solution to the Byzantine general’s problem: PoW.</p>\n<p>In PoW, miners compete, based on who has the most processing power, to validate\ntransactions. And for their efforts they are rewarded with transaction fees and\nnewly minted bitcoins. This is how Bitcoin creates new currency.  Bitcoin\nminers around the globe compete in a lottery-like system for these newly issued\nbitcoins, and the efficient market makes it so that the cost of the energy used\nby the global mining network is on the order of the block reward (plus\ntransaction fees).  Today, that turns out to be around $1M worth of electricity\nper day.  In addition, Bitcoin mining is being commoditized by <a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">large data\ncenters in places of the world where electricity is more affordable</a>, making it\ndifficult for laymen to participate.</p>\n<p>PoS, on the other hand, does away with the energy dependence of PoW entirely.\nIn PoS, miners are replaced with “validators” who have a stake in the system.\nValidators don’t have to invest in expensive processing systems but they do\nhave to purchase “staking tokens.” Any normal laptop will suffice to solve the\nalgorithm.</p>\n<p>Peercoin, <a href=\"https://bitshares.org/\">BitShares</a>,\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a>, and others already use some form of\nPoS, and Ethereum is planning a move to PoS in the near future. Yet, while PoS\nmakes practical sense, many people have <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">rallied against the use of\nPoS</a>, claiming it is\nimpossible to secure. But that is simply not true. Using BFT, you absolutely\ncan secure PoS.  It’s just that we haven’t seen any BFT-PoS public blockchains\nyet.</p>\n<p>While the theory may be difficult to explain or understand, the ultimate\nresults provided by proper BFT algorithms are simple to grasp.  Unlike PoW\nblockchains, BFT-PoS blockchains do not fork (i.e. get double-spend attacked)\nat all unless ⅓ or more validators coordinate such an attack.  And, when 1/3 or\nmore validators do cause a double-spend attack, we can computationally\ndetermine which validators were responsible for the attack, destroy their\nstaking tokens and eject them from the network.  It’s as if the staking tokens\nare virtualized PoW miners that blow up when used to attack the system.  No\nother blockchain consensus algorithm, including PoW, can provide the level of\ncollateralization that is possible with BFT-PoS.</p>\n<p>BFT-PoS performs extremely well. Today, in global public blockchain with a few\nhundred validators, you can get transaction finality on the  order of 3\nseconds, easily – no need to wait for additional block confirmations! The\ntheory has proven to us that these are optimal fault-tolerance thresholds for\n“instant-finality” blockchains.  While more validators does slow down\nconsensus, if <a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">Nielsen’s\nlaw</a> continues to hold,\nwe’ll even be able to support an exponentially increasing number of validators\nevery year with the same performance.</p>\n<p>In addition, BFT-PoS will also increase the security of mobile wallets. Few of\nthe mobile wallets in existence today take full advantage of the security\noffered by Bitcoin, for the simple fact that nobody is willing to wait an hour\nfor a transaction to clear. Instead, most wallets just assume that <a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">the person\nsending the money isn’t trying to double spend\nit</a>.\nAnd, though we don’t have time to dive into it here, efficient mobile wallet\nprotocols, or “light client SPV” protocols are the key to future blockchain\ninteroperability.</p>\n<p>While PoW worked well for Bitcoin, it’s costly, slow, and environmentally\nunfriendly. The best alternative out there right now is BFT-PoS. It’s an\nenduring, energy efficient solution that works well in asynchronous\nenvironments. And best of all, because BFT was developed by the best and the\nbrightest in the computer science industry, it’s provably secure. You can’t do\nany better than that.</p>\n",
      "dateFriendly": "2016-11-15"
    },
    {
      "title": "Purpose of Cosmos",
      "slug": "purpose-of-cosmos",
      "author": "Jae Kwon",
      "date": 1472601600000,
      "body": "<p>We believe in the power of public blockchains to provide a public good,\npowered by a collection of self-motivated actors governed by the rules of a\nshared consensus ledger, in an environment of competition and freedom of choice.\nWe have learned important lessons from the successes and failures of prior\ncryptocurrencies,  and have been creating innovations of our own that will\nunleash a new era of speed, security, scalability, and usability.</p>\n<p>Cosmos is a culmination of these lessons and innovations, designed to be\nextended to incorporate even future innovations, to create a distributed ledger\nplatform suitable for generations to come.</p>\n<p>One of the great tragedies of cryptocurrencies has been their failure to\ninteroperate with existing systems, and even with each other.  It is as if each\nvirtual currency, on its own blockchain and with its own community, were too\nsovereign for its own good.  This is made most apparent when you attempt to buy\nyour first Bitcoin: you discover that it is remarkably difficult to buy the new\ninternet money over the internet, at least without divulging considerable\namounts of personal information and allowing weeks for it to be verified by\nthird parties (exchanges) you hardly know and have been warned not to trust with\ntoo much of your money.</p>\n<p>While mechanisms like <a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">atomic\nswaps</a> between chains can\nhelp link communities, they suffer from a need for mature liquidity markets and\nactive participants on each side (or suffer long timeouts).  The <a href=\"https://coinmarketcap.com/\">alt-coin\necosystem</a> is an alchemical soup of enthusiasts\nexperimenting in various ways in new cryptocurrency design, but each alt-coin\nstands alone, siloed by the lack of a general inter-blockchain communication\nsystem, many needlessly wasting electricty through convoluted Proof-of-Work\n(PoW) designs.</p>\n<p><a href=\"https://ethereum.org/\">Ethereum</a> sought to address the problem, somewhat\nindirectly, by inventing a new platform for computation, allowing arbitrary\nfinancial systems to be written against a common virtual machine using a common\ndevelopment environment.  Presuming all new cryptocurrencies launch on Ethereum,\nthey will all have some capacity for interoperability.  Ethereum is a wonderful\nidea, but the design decisions, while motivated by important considerations\n(like the need for a simple specification and guaranteed determinism), neglect a\ngreat many more (like the difficulty of designing a secure general purpose\nprogramming environment), and lends Ethereum it’s own sovereignty problem, which\nis that it excludes users who want access to the platform but want alternatives\nto the current state transition machine.</p>\n<p>Of course, Ethereum doesn’t address the problem of turning fiat currency into\nether, either, short of having banks and major government bodies issue their\ncurrency on Ethereum.  And while\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">many</a>\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">such</a>\n<a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">institutions</a> are\ninvestigating the Ethereum blockchain, there are both scalability and governance\nconcerns that will restrict its full scale adoption, and hence impede\nintegration with existing systems and currencies.</p>\n<p>Each existing cryptocurrency supports some cultural ideal.  Bitcoin is decidedly\nlibertarian, with a slight anarchist leaning which is ultimately betrayed by the\neconomics of Proof-of-Work.  Ethereum is less a political statement and more an\navant garde academic excercise in distributed systems, computer science, and\ncontract theory.  Dogecoin is a testament to the capacity for Humans to bond\nover the absurd, a phenomenon more commonly known as “being social”.  Steem\noffers a more structured version of being social, with a basis in content\nproduction and curation.  And so on. But there are many more idealogical\ncurrencies to create, many more virtual machine designs to try, each affording a\nunique experiment in the intersection between governance, culture, and\neconomics.  Would it not be a tragedy for all these experiments to be so rigidly\nsiloed from one another by great chasms of incompatibility?</p>\n<p>Clearly, what we need is something more general than Ethereum - a sort of meta-Ethereum;\nsomething that can integrate existing codebases and the states of existing blockchains;\nsomething that can interface in a sane manner with the currencies issued by nation states;\nsomething that formalizes the relationship between cryptocurrencies and connects them without compromising their independence;\nsomething with extreme flexibility that does not compromise security.</p>\n<p>Enter Cosmos. Cosmos is a network and a framework for interoperability between\nblockchains.  It consists of a web of “hubs” and “zones”, where each “zone” is\neffectively an independent blockchain with an arbitrary cryptocurrency design\n(be it like Bitcoin, Ethereum, ZeroCash, CryptoNote, your local banking\ninstitution, etc.), and each “hub” is a multi-asset cryptocurrency that\nfacilitates interoperability between some set of zones.</p>\n<p>Hubs and zones are powered by the <a href=\"http://tendermint.com/\">Tendermint</a>\n<a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">Proof-of-Stake (PoS) consensus\nalgorithm</a>,\nusing the <a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP\ninterface</a> to host\napplications written in any programming language.  TMSP permits enormous\nflexibility in application design, and enables the application to inherit the\nsecurity features of a Tendermint-powered blockchain.</p>\n<p>Zones communicate with one another through a hub, primarily in the form of\nassymetric transfer of some set of tokens from one zone to another.\nEffectively, a hub is a blockchain with many\n<a href=\"https://blockstream.com/sidechains.pdf\">sidechains</a>, but using PoS instead of\nPoW leads to a dramatic reduction in overhead without sacrificing security.  The\ntrick is that each zone acts as a light client for the hub, and the hub acts as\na light client for all its zones.  <a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">Tendermint makes this\nefficient</a>\nwith compact light client proofs that are secure so long as the validator set is\nknown, which can be achieved by ensuring the light client <a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">synchronizes with\nvalidator set changes at least as often as they are permitted to\noccur</a>.</p>\n<p>Many people have <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">rallied against the use of\nProof-of-Stake</a>, claiming it is\nimpossible to secure.  Simultaneously, they acknowledge that it is nearly\ntrivial to secure many PoS chains using a single, secure PoW chain.  It is <a href=\"https://twitter.com/buchmanster/status/738550345597648896\">my\nown position</a> that\nthe correct number of PoW chains is one, and the correct number of PoS chains is\nin the thousands or millions, on par with the number of currencies, rewards\nsystems, and various other token-based systems in the world.</p>\n<p>Cosmos reflects this position in that it makes no distinction between hubs - there\nis no “top” hub, and the most popular or successful hub is a matter of adoption\nby zones.  Furthermore, there is no fundamental distinction between zones and\nhubs, such that any zone with sufficient functionality can become a hub.  While\nwe will release one particular hub in order to get things started (the aptly\nnamed Adam hub), there is nothing stopping this hub from becoming obsolete as\nother hubs, even the likes of Bitcoin or Ethereum themselves, come to compete\nwith it, and potentially replace it.</p>\n<p>Cosmos thus introduces a new kind of market dynamic that formalizes the power\nstruggle between the various cryptocurrency offerings, demolishing the barriers\nto interoperability and enabling competition between hubs to contribute to the\neconomic security of each hub itself - validators who misbehave will be\nabandoned for better behaving ones.  The result is a heterogeneous network,\nadapting for each community and each locale according to its needs, and yet\nretaining a backbone of interoperability that keeps barriers to entry low while\nholding stewards of the system accountable and quality of service high.</p>\n<p>Whether as testing grounds for new cryptocurrency designs, or an upgrade to\nexisting ones, as a means for decentralized exchange, or a platform for scalable\nsmart contracts, Cosmos’s potential is that of every existing cryptocurrency and\nmore in synergy.  The only question is, what will you build on Cosmos?</p>\n",
      "dateFriendly": "2016-08-31"
    }
  ],
  "ja": [
    {
      "title": "BFT：最も安全な証拠",
      "slug": "bft-the-most-secure-proof-of-stake",
      "author": "Jae Kwon",
      "date": 1479168000000,
      "body": "<p>Bitcoinはブロックチェーンに世界の注目を集めました。しかし、悲しいかな、Bitcoin\nブロックチェーンのバージョンは、世界のブロックチェーンのニーズには十分ではありません。それ\nBitcoinの作業証明書（PoW)のコンセンサス<a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">膨大な量\nエネルギー</a>。さらに、トランザクションは辛抱強く遅く、1時間かかります。\nコミットする時間が長くなります。そして、PoWの鉱夫は忠誠を払うインセンティブがほとんどないので\n1つのチェーンまたは他のアップグレードを調整することは困難です。\n \nブロックチェーンを安全に管理するためのアプローチが必要\n地球上のエネルギーコスト。そのアプローチは、ビザンチンのフォールトトレランス\n（BFT)ベースの（<a href=\"https://bitcointalk.org/index.php?topic=27787.0\">立証証拠</a>（PoS))。我々はそれをBFT-PoSと呼ぶ。\n \nBFT-PoSのメリットを掘り下げる前に、最初に\nビザンチンの断層は、<a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport’s General\nと彼の軍隊</a>。</p>\n<p>データが数百または数千に渡って複製される分散システム\n何らかのタイプのフォールトトレランスまたはコンセンサスが必要です\nアルゴリズムは、コンピュータが故障したりオフラインになったりする単純な事実\n時々。したがって、これらのノードの一部に障害が発生した場合、システム全体\nコンセンサスに達する必要があります。\n \n標準フォールトトレラントコンセンサスアルゴリズム\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a>と\n<a href=\"https://en.wikipedia.org/wiki/Paxos_%EF%BC%88computer_science\">Paxos</a>)は\nノードに障害が発生した場合、単に動作を停止し、応答を返送しません。\nGoogle、Facebook、および一部の既存のデータベース製品はすでにこのファミリを使用しています\nファイアウォール内のコンセンサスアルゴリズムを使用して、サービスが残っていることを確認する\n障害のあるコンピュータでも使用できます。</p>\n<p>しかし、これらのアルゴリズムはパブリックなブロックチェーンには適していません。\nパブリックブロックチェイン内にファイアウォールはありません。鉱業権を有する者（PoW)または\n（PoSの)ステークトークンが参加したり、ネットワークを妨害しようとすることさえあります。\n公的なブロックチェーン上でコンセンサスを得るためには、ビザンチンのフォールトトレランスが必要です。\nビザンチンの障害では、障害のあるノードは完全に任意の形で行動することができます\n方法。ノードは、それらが引き起こす被害を最大限にしようと共謀することさえできます。\n \nしたがって、本質的に、BFTコンセンサスアルゴリズムの目的は、信頼を確立することです\n他の関係のない当事者の間で\nインターネット。\n \nBFTは新しいものではありません。このコンセプトは、\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport、Shostak、Pease in\n1982</a>だけど\nLamportらは、このアルゴリズムの理論的実現可能性を、\nすべてのメッセージが常に到着する同期環境です。\n \nしかし現実の世界では、何かを提供するためにインターネットを本当に信頼することはできません\n定刻。だから1988年に<a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork、Lynch、Stockmeyer</a>（DLS)はアルゴリズムを提案した\nほとんど非同期環境で動作します。その後、1999年に<a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\nBarbara Liskov</a>は、継続的なBFTコンセンサス\nそれはBFTアルゴリズムの最先端技術であったが、それはまだ今日である。\n \nしかし、長い間、主流の報道機関はこれらの精緻な研究を無視していました。誰も\nBFT以外の学界や主要機関の重要性を理解した\nIBMとDARPA、Bitcoinが登場した2009年まで。 Bitcoinは最初のオープン\nグローバルな通貨元帳にBFTコンセンサスを提供する分散型アプリケーション、\nビザンティン将軍の問題に対する完全に斬新な解決策を使用しています。</p>\n<p>PoWでは、鉱業者は、処理能力の最も高い者に基づいて競争し、検証する\nトランザクション。そして彼らの努力のために、彼らは取引手数料と\n新しく作られたビットコイン。これは、Bitcoinが新しい通貨を作り出す方法です。 Bitcoin\n世界各地の鉱夫が新しく発行されたこれらの宝くじのようなシステムで競合する\nビットコインを使用し、効率的な市場では、使用されるエネルギーのコスト\nグローバル鉱業ネットワークでは、ブロック報酬（プラス\n取引手数料)。今日、それは約1Mの価値の電気であることが分かった\n1日あたりさらに、Bitcoinの鉱業は<a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">大規模なデータ\n電気がいっぱいの世界の中心にある手頃な価格</a>、それを作る\n一般人が参加することは困難です。\n \n一方、PoSは、PoWのエネルギー依存性を完全に排除します。\nPoSでは、鉱夫はシステムの利害関係者である「バリデーター」に置き換えられます。\nバリデータは高価な処理システムに投資する必要はありませんが、\n「ステキングトークン」を購入する必要があります。通常のラップトップであれば、\nアルゴリズム。\n \nPeercoin、<a href=\"https://bitshares.org/\">BitShares</a>、\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a>などは、すでに何らかの形で\nPoS、およびEthereumは、近い将来PoSへの移行を計画しています。しかし、PoS\n実用的な意味を持って、多くの人々が<a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">\nPoS</a>であると主張している\n安全を確保することは不可能です。しかし、それは単に真実ではありません。 BFTを使用すると、あなたは絶対に\nPoSを保護することができます。 BFT-PoSのパブリックブロックチェーンは見られません\nまだ。</p>\n<p>理論が説明したり理解したりするのは難しいかもしれませんが、究極の\n適切なBFTアルゴリズムによって得られる結果は把握するのが簡単です。 PoWとは異なり\nBFT-PoSブロックチェーンがフォークしない（つまり、二重の攻撃を受ける)\n3分の1以上のバリデーターがそのような攻撃を調整しない限り、そして、1/3または\nより多くのバリデータが二重支出攻撃を引き起こす場合、我々は計算上\nどのバリデータが攻撃の原因であったのかを判断し、\nトークンをステイキングしてネットワークから取り出します。あたかもトークをステイキングしているかのようです\n仮想化されたPoW鉱夫であり、システムの攻撃に使用されたときに爆発する。いいえ\nPoWを含む他のブロック鎖コンセンサスアルゴリズムは、\nBFT-PoSで可能な担保設定。</p>\n<p>BFT-PoSは非常に優れたパフォーマンスを発揮します。今日、いくつかのグローバルな公的ブロックチェーン\n百バリデーター、あなたは3のオーダーでトランザクションの最終を得ることができます\n秒、簡単に - 追加のブロック確認を待つ必要はありません！ザ\n理論は、これらが最適なフォールトトレランスしきい値であることを証明しています。\n&quot;瞬間的な&quot;ブロックチェーン。より多くのバリデータが減速しますが\nコンセンサス、<a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">Nielsen’s\n法律</a>は引き続き維持され、\n私たちは指数関数的に増加する数のバリデータをサポートすることさえできるでしょう\n毎年同じパフォーマンスで</p>\n<p>さらに、BFT-PoSはモバイルウォレットのセキュリティを強化します。いくつかの\n今日存在するモバイルウォレットは、セキュリティを最大限に活用しています\nBitcoinによって提供された、単純な事実のため誰も1時間待つつもりはない\nトランザクションがクリアされるようにします。代わりに、ほとんどの財布は<a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">人\nお金を送ることは二重にしようとしていないそれ</a>。\nそして、私たちはここでそれに乗り込む時間はありませんが、効率的なモバイルウォレット\nプロトコル、または「ライトクライアントSPV」プロトコルは、将来のブロックチェーンの鍵です\n相互運用性。</p>\n<p>PoWはBitcoinでうまくいきましたが、費用がかかり、遅く、環境的にも\n不親切な今のところ最良の選択肢はBFT-PoSです。それは\n非常に安定したエネルギー効率の高いソリューション\n環境。そして、BFTは最高の\nコンピュータサイエンス業界で最も明るい、確かに安全です。あなたはできません\nそれより優れています。</p>\n",
      "dateFriendly": "2016-11-15"
    },
    {
      "title": "Cosmosの目的",
      "slug": "purpose-of-cosmos",
      "author": "Jae Kwon",
      "date": 1472601600000,
      "body": "<p>私たちは、公共の利益を提供する公共のブロックチェーンの力を信じています。\n自己の動機付けされた役者の集まりによって運営されています。\n競争と選択の自由の環境で、共通のコンセンサス帳簿を使用しています。\n我々は、以前の成功と失敗から重要な教訓を学んだ\n私たち自身のイノベーションを創造してきました\nスピード、セキュリティ、スケーラビリティ、ユーザビリティという新しい時代を実現します。</p>\n<p>コスモスは、これらのレッスンとイノベーションの頂点です。\n将来のイノベーションを組み込み、分散元帳を作成するように拡張\n次世代に適したプラットフォーム</p>\n<p>Cryptocurrenciesの大きな悲劇の1つは、彼らの失敗であった。\n既存のシステムと相互運用することができ、相互にも相互運用できます。あたかもそれぞれ\nバーチャル通貨、独自のブロックチェーン、それにそれ自身のコミュニティもそうだった\n自分の利益のために主権。これはあなたが購入しようとするときに最も明らかになります\nあなたの最初のBitcoin：あなたはそれが新しい\nインターネットを通じたインターネットの通話、少なくとも漏れなく\n個人情報の量は、個人情報の\nあなたがほとんど知っておらず、信頼できないように警告されている第三者（交流)\nあなたのお金が多すぎます。</p>\n<p><a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">アトミック\nスワップ</a>チェーン間\n成熟した流動性市場の必要性に苦しんでおり、\n各側のアクティブな参加者（または長いタイムアウトに苦しむ)。 <a href=\"https://coinmarketcap.com/\">alt-coin\nエコシステム</a>は愛好家の錬金術師のスープです\n新しい暗号化設計ではさまざまな方法で実験を行っていますが、各アルトコイン\n一般的なブロック間通信がないため\nシステムでは、複雑な校正証明書を使用して不必要に多くの電力を浪費しています\n（PoW)設計に基づいている。</p>\n<p><a href=\"https://ethereum.org/\">Ethereum</a>はこの問題に多少対処したい\n計算のための新しいプラットフォームを発明して、間接的に、任意の\n共通の仮想マシンに対して一般的な方法で書き込まれる金融システム\n開発環境すべての新しい暗号化通信がEthereumで開始されると仮定すると、\n彼らはすべて相互運用性のためのいくらかの能力を持っています。エテリアムは素晴らしい\nアイデア、しかし重要な考慮事項によって動機付けられている間、設計の決定\n（単純な仕様と保証された決定論の必要性のように)、\n非常に多くのこと（安全な汎用目的の設計の難しさ\nプログラミング環境)、そしてそれ自身の主権問題であるEthereumを貸す。\nプラットフォームへのアクセスを希望するユーザーを除外しますが、代わりに必要なユーザー\n現在の状態遷移マシンに送信する。</p>\n<p>もちろん、エテリアムは金銭の通貨を\nエーテル、いずれか、銀行や主要な政府機関を持っていない\nEthereumの通貨。そして、\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">多くの</a>\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">そのような</a>\n<a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">機関</a>は次のとおりです。\nEthereumブロックチェーンを調査すると、スケーラビリティとガバナンスの両方があります\nそれが本格的な採用を制限する懸念があるため、\n既存のシステムと通貨との統合。</p>\n<p>既存の暗号のそれぞれが文化的な理想をサポートしています。 Bitcoinは確かに\n自由主義者であり、わずかなアナキストの傾きがあり、最終的には\n実績の経済学。エテリアムは政治的な声明ではなく、より多くの\n分散システムにおける前衛教育、コンピュータサイエンス、および\n契約理論。ドッグコインは、人類が結合する能力の証です\n不条理なことに、より一般的に「社会的」として知られる現象。 Steem\nコンテンツに基づいて、社会的であるというより構造化されたバージョンを提供します\n生産とキュレーション。等々。しかし、より多くの理想的な\n通貨を作成する、より多くの仮想マシンの設計を試して、それぞれの\nガバナンスと文化との交差点におけるユニークな実験\n経済。これらのすべての実験が非常に堅実であることは悲劇ではないでしょうか\n矛盾した大きな隙間によってお互いに孤立していますか？</p>\n<p>明らかに、我々が必要とするのは、Ethereumよりも一般的なものです.Etthereumはメタエタリウムの一種です。\n既存のコードベースと既存のブロックチェーンの状態を統合できるもの。\n国家によって発行された通貨とまったく同じようにインターフェースできるもの。\nCryptocurrencies間の関係を公式化し、それらの独立性を損なうことなくそれらを接続するもの。\nセキュリティを脅かさない極限の柔軟性を備えたもの</p>\n<p>宇宙に入る。コスモスはネットワークと相互運用性の枠組みです\nブロックチェーン。それは &quot;ハブ&quot;と &quot;ゾーン&quot;のウェブから成り、各 &quot;ゾーン&quot;は\n事実上、任意の暗号解読設計を備えた独立したブロックチェーン\n（Bitcoin、Ethereum、ZeroCash、CryptoNote、あなたのローカルバンキング\n機関など)、各「ハブ」は、マルチアセット暗号化であり、\n一部のゾーンセット間の相互運用性を促進します。</p>\n<p>ハブとゾーンは、<a href=\"http://tendermint.com/\">Tendermint</a>\n<a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">証拠の証拠（PoS)コンセンサス\nアルゴリズム</a>、\n<a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP\nインターフェース</a>をホストする\n任意のプログラミング言語で書かれたアプリケーション。 TMSPは膨大な\nアプリケーション設計の柔軟性を提供し、アプリケーションが\nTendermintで動くブロックチェーンのセキュリティ機能</p>\n<p>ゾーンは、主にハブを介して互いに通信します。\n1つのゾーンから別のゾーンへのトークンセットの非対称転送。\n事実、ハブは多数のブロックチェーン\n<a href=\"https://blockstream.com/sidechains.pdf\">sidechains</a>、代わりにPoSを使用する\nPoWを使用すると、セキュリティを犠牲にすることなくオーバーヘッドが大幅に削減されます。ザ\nそれぞれのゾーンがハブの軽いクライアントとして機能し、ハブが\nすべてのゾーンのための軽いクライアント。 <a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">テンダーミントはこれを作る効率的</a>\nバリデータセットが存在する限り、コンパクトなライトクライアントプルーフがセキュアです\nこれはライトクライアントを確実にすることで実現できます<a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">バリデータセットは少なくとも許可されている回数だけ変更されます発生する</a>。</p>\n<p>多くの人々が<a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">ステークホルダーの証明書</a>が主張している\n安全を確保することは不可能です。同時に、彼らはそれがほぼ\n1つの安全なPoWチェーンを使用して多数のPoSチェーンを保護することは些細なことです。それは<a href=\"https://twitter.com/buchmanster/status/738550345597648896\">私の\n自分の位置</a>\nPoWチェーンの正しい数は1であり、PoSチェーンの正しい数は\n何千万も何百万という、通貨の数、報酬\nシステム、および世界のさまざまな他のトークンベースのシステムです。</p>\n<p>コスモスは、この地位を反映して、ハブ間の区別はない\n「トップ」ハブではなく、最も一般的で成功したハブは採用の問題です\nゾーン別。さらに、ゾーンと\n十分な機能を備えた任意のゾーンがハブになることができるようになります。中\n私たちは物事を始めるために1つの特定のハブをリリースします（適切に\nAdamハブという名前の)、このハブの廃止を阻むものは何もありません\nBitcoinやEthereumのような他のハブも競争に来る\n潜在的にそれを置き換えることができます。</p>\n<p>コスモスはこのように、力を正式化する新しい種類の市場動向を導入する\n様々な暗号化サービスの間の闘争、障壁の解体\n相互運用性につながり、ハブ間の競争を可能にし、\nそれぞれのハブ自体の経済的なセキュリティ - 不正行為を行うバリデータは、\nより良い行動のために放棄された。その結果、異機種間ネットワーク、\nそれぞれのコミュニティと各ロケールのニーズに応じて適応させる\n相互運用性の基盤を維持し、侵入の障壁を低く抑えながら\nシステムの責任者と高いサービス品質を保持する。</p>\n<p>新しい暗号化設計のテストの根拠として、または\n既存のもの、分散型交換の手段、スケーラブルなプラットフォーム\nスマートな契約では、コスモスの潜在的可能性はすべての既存の暗号化と\n相乗効果でより多く。唯一の疑問は、あなたはコスモスで何を構築するのでしょうか？</p>\n",
      "dateFriendly": "2016-08-31"
    }
  ],
  "ko": [
    {
      "title": "BFT : 가장 안전한 스테이크 증언",
      "slug": "bft-the-most-secure-proof-of-stake",
      "author": "Jae Kwon",
      "date": 1479168000000,
      "body": "<p>Bitcoin은 블록 체인에 세계의 관심을 불러 일으켰습니다. 그러나 아아, Bitcoin\nblockchain 버전은 세계의 블록 체인 요구 사항에 충분하지 않습니다. 그\nBitcoin의 작업 증명 (PoW) 합의 <a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">엄청난 양의에너지</a>. 또한 트랜잭션은 한 시간 또는\n커밋하는 데 오래 걸린다. 그리고 광부 광부들은 충성스러운 인센티브가 거의 없기 때문에\n하나의 체인 또는 기타, 업그레이드를 조정하기가 어렵습니다.\n \n블록 체인을 안전하게 관리하는 접근 방식이 필요합니다.\n지구의 에너지 비용. 그 접근 방식은 비잔틴 결함 허용 오차입니다.\n(BFT) 기반의 <a href=\"https://bitcointalk.org/index.php?topic=27787.0\">스테이크 증명</a> (PoS). 우리는 이것을 BFT-PoS라고 부릅니다.\n \nBFT-PoS의 장점에 대해 알아보기 전에 먼저\n비잔틴 잘못은 <a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport’s General에 대한 혼란스러운 세부 사항에 빠지지 않고그의 군대</a>.</p>\n<p>수백 또는 수천 개의 데이터가 복제되는 분산 시스템에서\n노드 중 일부 유형에는 내결함성이나 컨센서스가 있어야합니다.\n알고리즘, 컴퓨터가 고장 나거나 오프라인 상태가되는 간단한 사실\n때로는. 따라서 노드 중 일부가 실패하면 전체 시스템은 여전히\n합의에 도달해야합니다.\n \n표준 내결함성 컨센서스 알고리즘\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a> 및\n<a href=\"https://en.wikipedia.org/wiki/Paxos_\" title=\"computer_science\">Paxos</a>는 다음과 같이 가정합니다.\n노드가 실패하면 작동을 멈추고 응답을 되돌려 보내지 않습니다.\nGoogle, Facebook 및 일부 기존 데이터베이스 제품에서 이미이 제품군을 사용하고 있습니다.\n방화벽 내에서 합의 알고리즘을 사용하여 서비스가 남아 있도록 보장\n결함이있는 컴퓨터에도 사용할 수 있습니다.</p>\n<p>그러나 이러한 알고리즘은 공용 블록 체인에 적합하지 않습니다.\n공개 블록 체인에 방화벽이 없습니다. 광업 능력을 지닌 사람 (PoW) 또는\n(PoS에서) 스테이크 토큰이 참여하거나 심지어 네트워크를 방해하려고 시도 할 수도 있습니다.\n공용 블록 체인에 대한 합의에 도달하려면 비잔틴 결함 허용 기능이 필요합니다.\n비잔틴 결함에서, 결함 노드는 완전히 임의적으로 행동 할 수있다.\n방법. 노드는 결점을 최대화하려고 시도 할 수 있습니다.\n \n따라서 본질적으로 BFT 합의 알고리즘의 목적은 신뢰를 확립하는 것입니다\n신뢰할 수없는 네트워크를 통해 다른 관계가없는 당사자들과\n인터넷.\n \nBFT는 새로운 것이 아닙니다. 개념은 처음으로 학술 논문에서 소개되었습니다.\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport, Shostak 및 Pease in\n1982</a>. 그러나\nLamport 등은 알고리즘의 이론적 타당성을\n모든 메시지가 항상 정시에 도착하는 동기식 환경\n \n그러나 현실 세계에서 무엇이든 제공하기 위해 인터넷을 믿을 수는 없습니다.\n제 시간에. 1988 년 <a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork, Lynch, Stockmeyer</a> (DLS)는 알고리즘을 제안했습니다.\n대부분 비동기 환경에서 작동합니다. 1999 년 말, <a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\n와 Barbara Liskov</a>는 지속적인 BFT 컨센서스를위한 실용적인 해결책을 제안했다.\nBFT 알고리즘의 최첨단 기술이었습니다.\n \n그러나 오랜 기간 동안 주류 언론은이 정액 작품을 무시했습니다. 아무도\n외부 학계와 주요 기관과 같은 BFT의 중요성을 이해했습니다.\nIBM과 DARPA, Bitcoin이 등장 할 때까지 2009. Bitcoin이 첫 번째 공개되었습니다.\n글로벌 통화 원장에 대한 BFT 합의를 제공하는 분산 애플리케이션,\n그러나 비잔틴 일반 문제에 대한 완전히 새로운 해결책을 사용하십시오 : PoW.</p>\n<p>PoW에서 광부는 누가 가장 많은 처리 능력을 가지고 있는지에 따라 경쟁을합니다\n업무. 그리고 그들의 노력으로 그들은 거래 수수료와\n새롭게 작성된 비트 코인. 이것은 Bitcoin이 새로운 통화를 만드는 방법입니다. 비트 코인\n전세계 광부들은 새로 발행 된 이들을 위해 복권과 같은 시스템에서 경쟁합니다\n비트 코인을 사용하고 있으며 효율적인 시장으로 인해 사용 된 에너지의 비용\n글로벌 광산 네트워크에 의해 블록 보상 (플러스\n거래 수수료). 오늘날, 그것은 약 1M의 가치가있는 전기로 밝혀졌습니다.\n하루에. 또한, Bitcoin 광산은 <a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">큰 데이터에 의해 commoditized되고있다\n전기가 더 많이 흐르는 세계의 중심지\n저렴한 가격</a>\n평신도가 참여하기 어렵다.\n \nPoS는 다른 한편으로는 PoW의 에너지 의존도를 완전히 없애줍니다.\nPoS에서는 광부가 시스템의 지분을 가진 &quot;유효성 검사기&quot;로 대체됩니다.\n검사기는 값 비싼 처리 시스템에 투자 할 필요가 없지만\n&quot;스테 킹 토큰 (steaking token)&quot;을 구입해야합니다.\n연산.\n \nPeercoin, <a href=\"https://bitshares.org/\">BitShares</a>,\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a> 및 다른 사람들은 이미\nPoS 및 Ethereum은 가까운 미래에 PoS 로의 이전을 계획하고 있습니다. 그러나 PoS\n실용적인 의미로, 많은 사람들이 <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">\nPoS</a>라고 주장하면서\n불가능하다. 하지만 그건 사실이 아닙니다. BFT를 사용하면 절대적으로\nPoS를 확보 할 수 있습니다. BFT-PoS 공개 블록 체인을 보지 못했습니다.\n아직.</p>\n<p>이론이 설명하거나 이해하기 어려울 수도 있지만 궁극적 인\n적절한 BFT 알고리즘에 의해 제공된 결과는 이해하기 쉽습니다. PoW와 달리\n블록 체인, BFT-PoS 블록 체인이 분기되지 않음 (즉, 이중 지출 공격 발생)\n1/3 이상의 유효성 검사기가 그러한 공격을 조정하지 않는 한 전혀. 그리고 1/3 또는\n더 많은 유효성 검사기가 이중 소비 공격을 야기하므로 계산적으로\n어떤 밸리데이터가 공격을 담당했는지 결정하고,\n스테이크 토큰을 가져와 네트워크에서 꺼냅니다. 그것은 토큰을 스테이 킹하는 것과 같습니다.\n가상 공격을받은 PoW 광부로서 시스템을 공격 할 때 폭발합니다. 아니\nPoW를 포함한 다른 블록 체인 컨센서스 알고리즘은\nBFT-PoS로 가능할 수있는 담보 제공</p>\n<p>BFT-PoS는 매우 잘 수행됩니다. 오늘날, 몇 개의 글로벌 공개 블록 체인\n백개의 유효성 검사기를 사용하면 트랜잭션 최종성을 3\n초, 쉽게 - 추가 블록 확인을 기다릴 필요가 없습니다! 그만큼\n이론은 이것이 최적의 폴트 허용 임계 값이라는 것을 우리에게 입증 해주었습니다.\n&quot;즉시 최종&quot;블록 체인. 더 많은 검사기가 속도를 늦추지 만\n공감대, <a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">Nielsen\n법률</a>\n우리는 기하 급수적으로 증가하는 검증자를 지원할 수도 있습니다.\n매년 같은 공연으로.</p>\n<p>또한 BFT-PoS는 모바일 지갑 보안을 강화합니다. 몇몇\n현재 존재하는 모바일 지갑은 보안을 최대한 활용합니다.\n아무도 1 시간을 기다릴 용의가 없다는 단순한 사실 때문에 Bitcoin이 제공했습니다.\n트랜잭션을 지우려면 대신, 대부분의 지갑은 <a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">사람\n돈을 보내는 것은 지출을 두 배로하려고하지 않고있다.\nit</a>.\n그리고 여기에 들어가기에는 시간이 없지만 효율적인 모바일 지갑\n프로토콜 또는 &quot;라이트 클라이언트 SPV&quot;프로토콜이 미래의 블록 체인의 열쇠입니다\n상호 운용성.</p>\n<p>PoW는 Bitcoin에서 잘 작동했지만 비용이 많이 들고 느리며 환경 적으로\n해로운. 지금 가장 좋은 대안은 BFT-PoS입니다. 그것은\n비동기 적으로 잘 작동하는 지속성있는 에너지 효율적인 솔루션\n환경. 무엇보다 BFT가 최고로 개발되었으므로\n컴퓨터 과학 업계에서 가장 밝은, 그것은 안전합니다. 너는 할 수 없어.\n그것보다 낫지.</p>\n",
      "dateFriendly": "2016-11-15"
    },
    {
      "title": "우주의 목적",
      "slug": "purpose-of-cosmos",
      "author": "Jae Kwon",
      "date": 1472601600000,
      "body": "<p>우리는 공공의 이익을 제공하기 위해 공공 구역의 힘을 믿습니다.\n의 규칙에 의해 규율되는 자발적인 배우의 수집에 의해 강화 해\n경쟁 환경과 선택의 자유 속에서 공감대를 공유했다.\n우리는 이전의 성공과 실패에서 중요한 교훈을 배웠습니다.\ncryptocurrencies, 그리고 우리 자신의 혁신을 만들어 왔습니다.\n속도, 보안, 확장 성 및 유용성의 새로운 시대를 열어보십시오.</p>\n<p>코스모스는 이러한 교훈과 혁신의 절정입니다.\n미래의 혁신까지도 포함하도록 확장, 분산 장부 작성\n플랫폼은 앞으로 다가올 세대에 적합합니다.</p>\n<p>cryptocurrencies의 큰 비극 중 하나는 그들의 실패\n기존 시스템과 상호 운용 할 수 있으며 심지어 서로간에 상호 운영 할 수 있습니다. 마치 각각의\n가상 통화, 자체 블록 체인 및 자체 커뮤니티에서도\n자신의 이익을 위해 주권. 구매를 시도 할 때 가장 분명하게 나타납니다.\n귀하의 첫 번째 Bitcoin : 당신은 새로운 것을 구입하는 것이 현저하게 어렵다는 것을 발견했습니다.\n인터넷을 통해 인터넷 돈, 적어도 상당한 누설하지 않고\n개인 정보의 양을 확인하고\n당신이 거의 모르는 제 3 자 (교환)와 신뢰하지 말라는 경고를 받았다.\n네 돈이 너무 많아.</p>\n<p><a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">원자\n스왑</a>은 체인 간의\n성숙한 유동성 시장에 대한 요구로 어려움을 겪고 있으며,\n각면에서 능동적 인 참가자 (또는 긴 시간 초과로 고통받는 사람). <a href=\"https://coinmarketcap.com/\">alt-coin\n생태계</a>는 열광 자들의 연금술 수프입니다.\n새로운 cryptocurrency 디자인에서 다양한 방법으로 실험하지만, 각각의 alt-coin\n일반적인 블록 간 통신이 없기 때문에 혼자 서있다.\n시스템, 많은 사람들이 복잡한 필기구를 통해 불필요하게 전기 낭비\n(PoW) 디자인.</p>\n<p><a href=\"https://ethereum.org/\">Ethereum</a>은 문제를 다소 해결하려고 노력했습니다.\n계산을위한 새로운 플랫폼을 발명함으로써 간접적으로\n공통 가상 머신에 대해 작성된 금융 시스템\n개발 환경. Ethereum에서 새로운 크립토 통화가 시작된다고 가정하면,\n그들은 모두 상호 운용성을위한 약간의 능력을 가지고있을 것이다. Ethereum은 훌륭합니다.\n아이디어,하지만 중요한 결정에 의해 동기를 부여하면서 디자인 결정\n(간단한 명세와 보장 된 결정론의 필요성과 같은),\n엄청나게 많은 것 (안전한 일반적인 목적을 설계하는 어려움\n프로그래밍 환경), Ethereum을 빌려주는 것은 자신의 주권 문제이다.\n플랫폼에 대한 액세스를 원하지만 대안을 원하는 사용자를 제외한다는 것입니다.\n현재 상태 전이 기계로</p>\n<p>물론, 에테 리엄 (Ethereum)은 화폐 통화를\n에테르 중 하나, 은행 및 주요 정부 기관에 부족\nEthereum에 통화. 그리고 얼마 동안\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">many</a>\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">그러한</a>\n<a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">기관</a>은\nEthereum 블록 체인을 조사 할 때, 확장 성 및 거버넌스가 있습니다.\n그것의 전면적 인 채용을 제한 할 우려가 있고, 따라서\n기존 시스템 및 통화와의 통합.</p>\n<p>기존의 cryptocurrency는 각각 문화적 이상을 지원합니다. Bitcoin은 분명히 있습니다.\nlibertarian,에 의해 배반되는 경미한 무정부주의자 기울기와 더불어.\n증명의 경제학. 에테 리엄은 정치적 진술이 아니며\n분산 시스템에서의 전위적인 학술 연구, 컴퓨터 과학, 그리고\n계약 이론. Dogecoin은 인간이 채권을 수있는 능력에 대한 증거입니다.\n불합리한 것, 더 일반적으로 &quot;사회적 존재&quot;로 알려진 현상. Steem\n내용에 기초를 둔 사회 구조의보다 구조화 된 버전을 제공합니다.\n생산 및 큐레이터. 등등. 그러나 더 많은 이데올로기 적\n통화를 만들려는 시도, 더 많은 가상 머신 디자인, 각 affording\n거버넌스, 문화, 그리고\n경제학. 이 모든 실험이 너무 엄격하게 비극적이지 않을까요?\n서로 양립 할 수없는 커다란 틈으로</p>\n<p>분명히, 우리가 필요로하는 것은 Ethereum보다 더 일반적인 것입니다 - 일종의 meta-Ethereum입니다;\n기존 코드베이스와 기존 블록 체인의 상태를 통합 할 수있는 것.\n국가 국가들이 발행 한 화폐와 정상적인 방식으로 상호 작용할 수있는 것;\ncryptocurrencies 사이 관계를 형식화하고 그들의 독립을 손상하지 않고 그들을 연결하는 무언가;\n보안을 손상시키지 않는 뛰어난 유연성을 제공합니다.</p>\n<p>코스모스에 입장하십시오. Cosmos는 네트워크와 상호 운용성을위한 프레임 워크입니다.\n블록 체인. 그것은 &quot;hubs&quot;와 &quot;zones&quot;의 웹으로 이루어져 있습니다. 각 &quot;zone&quot;은\n효과적으로 임의의 cryptocurrency 설계를 가진 독립적 인 블록 체인\n(Bitcoin, Ethereum, ZeroCash, CryptoNote, 지역 은행\n기관 등), 각 &quot;허브&quot;는 다중 자산 크립토 커 런시 (cryptocurrency)\n일부 영역 세트 간의 상호 운용성을 용이하게합니다.</p>\n<p>허브 및 존은 <a href=\"http://tendermint.com/\">Tendermint</a>\n<a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">스테이크 증언 (PoS) 합의\n알고리즘</a>,\n<a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP\n인터페이스</a>에서 호스트\n모든 프로그래밍 언어로 작성된 응용 프로그램. TMSP는 엄청난 양의\n응용 프로그램 디자인의 유연성을 제공하고 응용 프로그램이\nTendermint-powered blockchain의 보안 기능.</p>\n<p>영역은 주로 허브를 통해 서로 통신합니다.\n한 영역에서 다른 영역으로의 토큰 세트의 비대칭 형 전송.\n사실 허브는 많은 블록 체인입니다.\n<a href=\"https://blockstream.com/sidechains.pdf\">sidechains</a> 대신 PoS를 사용합니다.\nPoW는 보안을 희생하지 않고 오버 헤드를 대폭 감소시킵니다. 그만큼\n트릭은 각 영역이 허브의 경량 클라이언트 역할을하며 허브가\n모든 영역에 대한 가벼운 클라이언트. <a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">텐더 민트가 이것을 만든다.\n효율적인</a>\n유효성 검사기 세트가있는 한 안전하고 컴팩트 한 라이트 클라이언트 교정기로\n알려진 바는 라이트 클라이언트를 보장함으로써 달성 할 수있다.\n유효성 검사기 집합은 적어도 허용 된 횟수만큼 변경됩니다.\n<a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">발생</a>.</p>\n<p>많은 사람들이 <a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">\n스테이크 증서</a>에\n불가능하다. 동시에, 그들은 그것이 거의\n하나의 안전한 PoW 체인을 사용하여 많은 PoS 체인을 보호하는 것은 간단합니다. <a href=\"https://twitter.com/buchmanster/status/738550345597648896\">내\n자신의 위치</a>\nPoW 체인의 정확한 수는 1이며 올바른 PoS 체인 수는 1입니다.\n수천 또는 수백만에 달하는 통화의 수, 보상\n시스템 및 세계의 다양한 토큰 기반 시스템을 지원합니다.</p>\n<p>코스모스는 허브 간의 구별이 없다는 점에서이 입장을 반영합니다.\n&quot;최고의&quot;허브가 아니며 가장 인기 있거나 성공적인 허브가 채택 문제입니다.\n구역별로. 더구나, 영역과 영역 사이에는 근본적인 구별이 없습니다.\n충분한 기능을 가진 모든 영역이 허브가 될 수 있습니다. 동안\n우리는 물건을 시작하기 위해 하나의 특정 허브를 공개 할 것입니다 (적절하게\nAdam 허브라고 함),이 허브가 더 이상 쓸모 없게되는 것을 막을 수있는 방법은 없습니다.\nBitcoin이나 Ethereum과 같은 다른 허브도 경쟁을하게됩니다.\n잠재적으로 그것을 대체하십시오.</p>\n<p>따라서 코스모스는 권력을 형식화하는 새로운 종류의 시장 동태를 소개합니다\n다양한 암호 해독 오퍼링 사이의 투쟁, 장벽 제거\n상호 운용성 및 허브 간 경쟁 활성화를 통해\n각 허브 자체의 경제적 보안 - 오작동하는 유효성 검사기는\n더 나은 행동을 위해 버려졌습니다. 결과는 이기종 네트워크이며,\n필요에 따라 각 지역 사회 및 각 지역에 맞게 조정할 수 있습니다.\n장벽을 계속 낮추는 상호 운용성의 백본을 유지하면서\n시스템의 청지기를 책임지고 높은 서비스 품질을 유지합니다.</p>\n<p>새로운 cryptocurrency 디자인을 테스트하는 근거로 사용하거나 또는\n기존의 것, 분산 된 교환 수단 또는 확장 가능한 플랫폼\n현명한 계약 인 Cosmos의 잠재력은 모든 기존 암호 해독 및\n시너지 효과가 더 많습니다. 유일한 질문은, 당신은 우주에서 무엇을 만들 것입니까?</p>\n",
      "dateFriendly": "2016-08-31"
    }
  ],
  "zh": [
    {
      "title": "BFT：最安全的证明",
      "slug": "bft-the-most-secure-proof-of-stake",
      "author": "Jae Kwon",
      "date": 1479168000000,
      "body": "<p>比特币将世界的注意力带到区块链。但唉，比特币\n版本的blockchain不足以满足世界的区块链需求。那\n是因为比特币的工作证明（PoW)的共识<a href=\"http://motherboard.vice.com/read/bitcoin-could-consume-as-much-electricity-as-denmark-by-2020\">需要大量的\n能源</a>。此外，交易非常缓慢，需要一个小时或\n更长的提交。而且因为PoW矿工没有激励去忠诚\n一个链或其他，升级难以协调。\n \n我们需要一种安全地管理blockchains的方法，而不是强加一个巨大的\n我们星球上的能源成本。这种方法是拜占庭容错\n（BFT)为基础的<a href=\"https://bitcointalk.org/index.php?topic=27787.0\">proof-of-stake</a>（PoS)。我们称之为BFT-PoS。\n \n在我深入探讨BFT-PoS的优点之前，让我先谈一下这个概念\n拜占庭的错误，没有进入混乱的细节<a href=\"http://pages.cs.wisc.edu/~sschang/OS-Qual/reliability/byzantine.htm\">Lamport的将军\n和他的军队</a>。</p>\n<p>在分布式系统中，数据被复å¶到数百或数千\n的节点，需要某种类型的容错或共识\n算法，对于计算机崩溃或离线的简单事实\n时间。因此，如果这些节点的一部分失败，系统作为一个整体静止\n需要达成共识。\n \n标准容错共识算法如\n<a href=\"https://raft.github.io/raft.pdf\">Raft</a>和\n<a href=\"https://en.wikipedia.org/wiki/Paxos_%EF%BC%88computer_science\">Paxos</a>)假设\n当节点故障时，它只是停止工作，不发送回复。\nGoogle，Facebook和一些现有的数据库产品已经使用这个系列\n的协议算法在其防火墙内，以确保服务保持\n可用，尽管计算机有故障。</p>\n<p>但是这些算法不适合公共区块链，因为有\n没有防火墙在公共区块链。任何有采矿权力（在PoW)或\n放置令牌（在PoS中)可以参与，或甚至试图破坏网络。\n为了在公共区块链上达成共识，我们需要拜占庭容错。\n在拜占庭故障中，故障节点可以完全任意行为\n方式。节点甚至可以合谋尝试和最大化他们造æ的损害。\n \n因此，本质上，BFT一致性算法的目的是建立信任\n在不可信网络之间的其他不相关方\n互联网。\n \nBFT不是什么新鲜事。这个概念首先在一篇学术论文中被引入\n<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\">Lamport，Shostak和Pease\n1982</a>。但\nLamport等人仅仅证明了算法的理论可行性\n一个同步环境，其中所有的消息总是准时到达。\n \n但在现实世界中，你不能真正相信互联网提供任何东西\n准时。因此，在1988年，<a href=\"http://groups.csail.mit.edu/tds/papers/Lynch/jacm88.pdf\">Dwork，Lynch和Stockmeyer</a>（DLS)提出了一种算法\n在大多数异步环境中工作。 1999年后期，<a href=\"http://pmg.csail.mit.edu/papers/osdi99.pdf\">Miguel Castro\n和Barbara Liskov</a>提出了一个连续的BFT共识的实用解决方案\n这就是，现在仍然是BFT算法的最先进的。\n \n但长期以来，主流媒体忽视了这些创新的作品。没有人\n了解BFT在学术界和ä¸»要机构之外的重要性\nIBM和DARPA，直到2009年比特币出现。比特币是第一次打开\n分散应用，为全球货币分类帐提供BFT共识，\n但使用一个完全新颖的解决方案拜占庭将军的问题：PoW。\n \n在PoW中，矿工根据具有最大处理能力的人进行竞争，以进行验证\n交易。为了他们的努力，他们得到交易费和\n新铸造的比特币。这就是比特币如何创造新货币。比特币\n全球矿工在这些新发行的彩票式系统中竞争\n比特币，有效的市场使得使用的能源的成本\n由全球矿业网络对块的奖励（加上\n交易费)。今天，事实证明是价值约100万美元的电力\n每天。此外，比特币挖掘正在被<a href=\"https://bitcointalk.org/index.php?topic=1072474.0\">大数据商品化\n在世界上电力更多的地方的中心价格</a>，使它\n困难的外行人参加。\n \n另一方面，PoS完全消除了PoW的能量依赖性。\n在PoS中，矿工被与系统有利害关系的“验证者”取代。\n验证者不必投资昂贵的处理系统，但他们做\n必须购买“赌注令牌”。任何普通的笔记本电脑都足以解决\n算法。</p>\n<p>Peercoin，<a href=\"https://bitshares.org/\">BitShares</a>，\n<a href=\"https://en.wikipedia.org/wiki/Nxt\">Nxt</a>，而其他人已经使用某种形式\nPoS和Ethereum正在计划在不久的将来迁移到PoS。然而，虽然PoS\n有实际意义，很多人都<a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">反对使用PoS</a>，声称是\n不可能安全。但这根本不是真的。使用BFT，你绝对\n可以保护PoS。这只是我们没有看到任何BFT-PoS公共区块链\n然而。</p>\n<p>虽然理论可能难以解释或理解，但最终的\n由适当的BFT算法提供的结果易于掌握。不像PoW\n区块链，BFT-PoS区块链不叉（即获得双重花费攻击)\n除非1/3或更多的验证器协调这种攻击。而且，当1/3或\n更多的验证器确实导致双花费攻击，我们可以计算\n确定哪些验证者负责攻击，销毁它们\n放置令牌并将其从网络中弹出。它就像放置令牌\n是虚拟化的PoW矿工，当用来攻击系统时爆炸。没有\n其他区块链共识算法，包括PoW，都可以提供水平\n可能与BFT-PoS的抵押。</p>\n<p>BFT-PoS性能非常好。今天，在全球公共区块链中有几个\n一百个验证器，你可以得到事务的定单3\n秒，容易 - 无需等待额外的块确认！的\n理论已经证明我们这些是最佳的容错阈值\n“即时决定”区块链。虽然更多的验证器会减慢\n共识，如果<a href=\"https://www.nngroup.com/articles/law-of-bandwidth/\">尼尔森的\n法律</a>继续持有，\n我们甚至能够支持指数增长的验证器数量\n每年都有同样的表现。</p>\n<p>此外，BFT-PoS还将提高移动钱包的安全性。少数\n移动钱包在今天存在的充分利用了安全性\n由Bitcoin提供，因为一个简单的事实，没有人愿意等待一个小时\n以便交易清除。相反，大多数钱包只是假设<a href=\"https://www.coingecko.com/buzz/peter-todd-explains-the-problems-with-unconfirmed-bitcoin-transactions\">人发送钱是不是试图双支出it</a>。\n而且，虽然我们没有时间在这里潜水，高效的移动钱包\n协议或“轻客户端SPV”协议是未来区块链的关键\n互操作性。</p>\n<p>虽然PoW在比特币方面表现良好，但成本高，运行缓慢，而且环境友好\n不友好。现在最好的替代品是BFT-PoS。这是一个\n持久，节能的解决方案，在异步工作良好\n环境。最好的，因为BFT是由最好的和\n最聪明的计算机科学工业，它证明是安全的。你不能做\n任何比那更好。</p>\n",
      "dateFriendly": "2016-11-15"
    },
    {
      "title": "Cosmos的目的",
      "slug": "purpose-of-cosmos",
      "author": "Jae Kwon",
      "date": 1472601600000,
      "body": "<p>我们相信公共区块链的力量提供公共利益，\n动力由一个自我激励的演员的集合由a的规则控制\n共享共识分类帐，在竞争和选择自由的环境中。\n我们从先前的成功和失败中学到了重要的教训\n加密货币，并已经创造了我们自己的创新\n释放速度，安全性，可扩展性和可用性的新时代。</p>\n<p>Cosmos是这些教训和创新的高潮，旨在\n扩展到纳入未来的创新，创建分布式分类帐\n平台适合世代来。</p>\n<p>加密货币的一个巨大悲剧是他们的失败\n与现有系统互操作，甚至与彼此互操作。它就好像每个\n虚拟货币，在自己的区块链上和与自己的社区，太\n主权为自己的好。这是最明显的，当你试图买\n你的第一个比特币：你发现，这是非常困难的买新的\n互联网上的钱，至少没有泄露相当多\n数量的个人信息，并允许它的验证周数\n第三方（交易所)你几乎不知道，并已被警告不信任\n太多的钱。</p>\n<p>虽然机制像<a href=\"https://en.bitcoin.it/wiki/Atomic_cross-chain_trading\">原子swaps</a>\n帮助链接社区，他们需要成熟的流动性市场\n每个活动参与者（或遭受长时间超时)。 <a href=\"https://coinmarketcap.com/\">alt-coin生态系统</a>是爱好者的炼金汤\n在新的加密货币设计中以各种方式进行尝试，但是每个alt-coin\n孤独，由于缺乏一般的区块间链通信而沉默\n系统，许多不必要的浪费电气通过复杂的工作证明\n（PoW)设计。</p>\n<p><a href=\"https://ethereum.org/\">Ethereum</a>试图解决这个问题\n间接地，通过发明一个新的计算平台，允许任意\n金融系统要使用公共的虚拟机来编写\n开发环境。假设所有新的加密货币在以太坊上市，\n他们将具有一定的互操作能力。以太坊是一个美好的\n想法，但设计决定，同时受到重要考虑的驱动\n（如需要一个简单的规范和保证的确定论)，忽略a\n更多（比如设计一个安全的通用目的的困难\n编程环境)，并借给以太坊它自己的主权问题，这\n是，它排除了想要访问平台但想要替代品的用户\n到当前状态转换机。</p>\n<p>当然，以太坊并没有解决将法定货币转换成的问题\n乙醚，没有银行和主要政府机构发行\n以色列的货币。而且\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">many</a>\n<a href=\"http://www.coindesk.com/south-africa-diy-ethereum-blockchain-tests/\">such</a>\n<a href=\"http://www.coindesk.com/fidor-ethereum-core-banking/\">机构</a>\n调查以太坊blockchain，有可扩展性和治理\n这将限制其全面采用，从而阻碍\n与现有系统和货币的集成。</p>\n<p>每个现有的cryptocurrency支持一些文化理想。比特币是明智的\n自由主义者，有一个轻微的无政府主义倾斜，最终被背叛\n经济学的工作证明。以太坊不是一个政治声明，而是一个\n分布式系统，计算机科学中的先锋派学术演习\n合同理论。 Dogecoin是人类结合的能力的证明\n超越荒谬的，一种更常被称为“社会”的现象。 Steem\n提供一个更加结构化的社会性版本，内容基础\n生产和管理。等等。但有更多的理想\n货币创造，更多的虚拟机设计尝试，每一个提供一个\n独特的实验，在治理，文化和\n经济学。不是所有这些实验都是如此僵硬的悲剧\n彼此之间由不相容的伟大的chasms相互孤立？</p>\n<p>显然，我们需要的是比以太坊更一般的东西 - 一种元以太网;\n可以集成现有的代码库和现有区块链的状态;\n可以与民族国家发行的货币以相同的方式接口的东西;\n使加密货币之间的关系形式化并连接它们而不损害它们的独立性;\n具有极高的灵活性，不会危及安全性的东西。</p>\n<p>输入Cosmos。 Cosmos是一个网络和框架之间的互操作性\n区块链。它由一个“集线器”和“区域”的网络组成，每个“区域”是\n实际上是具有任意加密货币设计的独立区块链\n（就像Bitcoin，Ethereum，ZeroCash，CryptoNote，你的本地银行\n机构等)，并且每个“集线器”是多资产加密货币\n促进一些区域集之间的互操作性。</p>\n<p>集线器和区域由<a href=\"http://tendermint.com/\">Tendermint</a>\n<a href=\"https://github.com/tendermint/tendermint/wiki/Byzantine-Consensus-Algorithm\">Proof-of-Stake（PoS) consensus 算法</a>\n使用<a href=\"http://tendermint.com/blog/tendermint-socket-protocol/\">TMSP接口</a>主机\n应用程序以任何编程语言编写。 TMSP允许巨大\n灵活性的应用程序设计，并使应用程序能够继承\nTendermint供电的区块链的安全特性。</p>\n<p>区域通过集线器彼此通信，主要以形式\n一些令牌从一个区域到另一个区域的非对称传输。\n有效地，一个枢纽是一个区块链有很多\n<a href=\"https://blockstream.com/sidechains.pdf\">sidechains</a>，但使用PoS而不是\nPoW导致大量降低开销而不牺牲安全性。的\n诀窍是每个区域作为中枢的轻客户端，中枢充当\n所有区域的轻客户端。 <a href=\"https://github.com/tendermint/tendermint/wiki/Light-Client-Protocol\">Tendermint做到这一点\n高效</a>\n只要验证器集合是紧凑的轻客户端证明是安全的\n已知的，这可以通过确保光客户端<a href=\"https://blog.ethereum.org/2014/11/25/proof-stake-learned-love-weak-subjectivity/\">同步来实现验证器集合的更改频率至少与允许的相同发生</a>。</p>\n<p>很多人都反对使用\n<a href=\"https://download.wpsoftware.net/bitcoin/pos.pdf\">Proof-of-Stake</a>，声称它是\n不可能安全。同时，他们承认它几乎\n使用单个，安全的PoW链安全许多PoS链。这是<a href=\"https://twitter.com/buchmanster/status/738550345597648896\">我的\n自己的位置</a>\nPoW链的正确数量为一，并且PoS链的正确数量为\n在数千或数百万，与货币数量相等，奖励\n系统和各种其他基于令牌的系统。</p>\n<p>Cosmos反映了这一立场，因为它不区分中心 - 那里\n是没有“顶”中心，最流行或成功的中心是采用的问题\n按区域。此外，区域和之间没有根本区别\n集线器，使得具有足够功能的任何区域可以变为集线器。而\n我们将发布一个特定的中心，以便开始（适当地\n名为亚当中心)，没有什么能阻止这个中心变得过时\n其他中心，甚至比特币或以太坊自己，喜欢比赛\n与它，并可能取代它。</p>\n<p>Cosmos因此引入了一种新的形式化权力的市场动态\n在各种cryptocurrency产品之间的斗争，拆除障碍\n以实现互操作性并实现集线器之间的竞争\n经济安全的每个中心本身 - 验证者谁行为不端\n抛弃为更好的行为。结果是异构网络，\n根据其需要适应每个社区和每个地区，然而\n保持互操作性的骨干，同时保持进入低门槛\n控股系统负责人和服务质量高。</p>\n<p>是否作为新的cryptocurrency设计的测试依据，或升级到\n现有的，作为分散交换的手段，或可扩展的平台\n智能合同，Cosmos的潜力是每一个现有的加密货币和\n更多的协同。唯一的问题是，你将在Cosmos上建立什么？</p>\n",
      "dateFriendly": "2016-08-31"
    }
  ]
}